[
  {
    "title":"Macau gaming up 19% for June on strength of entertainment",
    "date":"2025-07-01T16:28:24",
    "link":"https:\/\/igamingbusiness.com\/finance\/full-year-results\/macau-gaming-june-revenue-increase-strength-entertainment\/",
    "content":"\n<p>The Macau casino industry finished June on a high note. Gross gaming revenue for the month came to MOP21.06 billion ($2.6 billion), up 19% year on year. Added to a robust performance in May – a 5% boost in GGR versus the consensus of 2.7% – it brings total GGR so far to MOP118.77 billion, up 4.4% over 2024.<\/p>\n\n\n\n<p>It’s a welcome development for the Asian gaming mecca, which <a href=\"https:\/\/igamingbusiness.com\/casino\/analysts-macau-on-the-way-to-full-recovery-by-26\/\" target=\"_blank\" rel=\"noreferrer noopener\">started the year strongly<\/a> only to see the momentum dwindle.<\/p>\n\n\n\n<p>Last year, anticipating a bump in tourism, government officials set a <a href=\"https:\/\/igamingbusiness.com\/casino\/macau-tourism-to-stoke-ggr-in-new-year\/\" target=\"_blank\" rel=\"noreferrer noopener\">GGR target of MOP240 billion<\/a> for 2025. Industry analysts were even more upbeat. Citi’s George Choi and Timothy Chau projected a 7% increase in GGR year-over-year, for a total of MOP244 billion.<\/p>\n\n\n\n<p>But those hopes soon dimmed. Following lacklustre revenues in January and February, the government <a href=\"https:\/\/igamingbusiness.com\/casino\/tourism\/macau-chief-executive-projected-revenue-gaming-slump\/\" target=\"_blank\" rel=\"noreferrer noopener\">adjusted its expectations<\/a> downward, resetting the yearly total to MOP228 billion.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-june-boost-tied-to-god-of-song\">June boost tied to ‘God of song’<\/h2>\n\n\n\n<p>June’s results put Macau on track to meet and surpass the government’s revised forecast – and all because of a 60ish crooner called the “Heavenly King of Cantopop”.<\/p>\n\n\n\n<p>According to <a href=\"https:\/\/www.macaubusiness.com\/june-gaming-revenue-jumps-19-pct-to-mop21-06-billion\/\" target=\"_blank\" rel=\"noreferrer noopener\">Macau Business<\/a>, JP Morgan analysts credited superstar Jacky Cheung – also known as “the God of song” – for the “unexpected seasonal surge”.<\/p>\n\n\n\n<p>The Citi team concurred. “We conducted our June 2025 table survey on the first night Cheung performed,” wrote Choi and Chau. “And we attribute all the positive findings from our survey to him” – including a 16% increase in premium players that night and a 36% increase in the the average wager.<\/p>\n\n\n\n<p>Vitaly Umansky of <a href=\"https:\/\/sso.bluematrix.com\/idp\/authn?conversation=e1s1&amp;OCT=M57S-OIS3-8QHK-MRW5\" target=\"_blank\" rel=\"noreferrer noopener\">Seaport Research Partners<\/a>, too, cited “strong entertainment events [and] high hold” for the upturn. <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2025-07-01\/macau-gaming-revenue-soars-past-estimate-on-concert-fervor\" target=\"_blank\" rel=\"noreferrer noopener\">Bloomberg<\/a> also tied the revenue boost to “concert fervour”.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-renewed-optimism-for-second-half\">Renewed optimism for second half<\/h2>\n\n\n\n<p>With more special events planned for July – Cheung’s “60-Plus” concert series continues at Galaxy Macau through Sunday – Seaport expects GGR to rise 10.2% year on year for the month. The investment firm has also upped its forecast for the second half, estimating 6.8% growth for the period and total annual GGR growth of 5.6%.<\/p>\n\n\n\n<p>“Growth should be driven by increased marketing efforts by operators and improving consumer trends in China,” Umansky wrote. “China stimulus and policy measures are likely to help shore up China&#8217;s economy and improve consumer confidence later this year.”<\/p>\n"
  },
  {
    "title":"Portugal online gambling market begins to slow in Q1 2025 after last year’s record numbers",
    "date":"2025-07-01T16:21:42",
    "link":"https:\/\/igamingbusiness.com\/casino\/portugal-online-gambling-market-q1-2025\/",
    "content":"\n<p>Portugal’s online gambling gross revenue dropped quarter-on-quarter for the first time in almost three years for Q1 2025, with the market showing signs of levelling off after consistent growth.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.srij.turismodeportugal.pt\/sites\/default\/files\/2025-06\/estatisticas_online_1t_2025.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Data published<\/a> by the Gaming Regulation and Inspection Service showed online gambling gross revenue of €284.7 million ($335.4 million) for the quarter. This was up 9% year-on-year and was driven by sports betting margins, which were 23% for the quarter.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-run-of-growth-comes-to-an-end\"><strong>Run of growth comes to an end<\/strong><\/h2>\n\n\n\n<p>However, the total was <a href=\"https:\/\/igamingbusiness.com\/finance\/quarterly-results\/record-portugal-online-gambling-revenue-q4\/\" target=\"_blank\" rel=\"noreferrer noopener\">down from the record €323 million<\/a> posted for Q4 2024. It is the first time the market has reported a quarter-on-quarter decrease since Q2 2022 and at 12% was the largest percentage drop compared to a previous quarter since 2018.<\/p>\n\n\n\n<p>Online casino gross revenue made up 60% of the total with €169.7 million, up 6% year-on-year and down 8% quarter-on-quarter.<\/p>\n\n\n\n<p>Online sports betting gross revenue also produced a modest increase, with the €114.9 million total being up 14% year-on-year. This total was down 17% compared to the previous quarter though, marking the largest quarter-on-quarter drop in this field since 2022.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-market-maturation\"><strong>Market maturation<\/strong><\/h2>\n\n\n\n<p>Ricardo Domingues, board chairman for the industry trade body Portuguese Online Betting and Gambling Association (APAJO), said the signs of deceleration in the market are “something natural in a market that is maturing. We face these variations calmly and our main concern continues to be being able to absorb demand in the face of the threat from illegal operators.”<\/p>\n\n\n\n<p>Despite the drop in gross revenue, the number of active online gambling accounts in Portugal went up 7% from the previous quarter to 4.8 million.<\/p>\n\n\n\n<p>Portugal’s government collected €82.7 million in online gambling tax for the quarter, which APAJO said was in line with the government’s target for its Environmental Fund.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-a-decade-in-operation\"><strong>A decade in operation<\/strong><\/h2>\n\n\n\n<p>Portugal’s regulated online gambling market has now been live for more than a decade, with online gambling being signed into law in April 2015.<\/p>\n\n\n\n<p>The market has since grown to 30 licensees, with 13 in online sports betting and 17 in online casino. <\/p>\n\n\n\n<p>Last year, the market generated gross revenue of €1.11 billion, which was a considerable increase on the €845 million posted for 2023.<\/p>\n"
  },
  {
    "title":"Cirsa aiming for €2.5 billion post-IPO valuation to fund M&amp;A spree",
    "date":"2025-07-01T09:42:09",
    "link":"https:\/\/igamingbusiness.com\/strategy\/cirsa-ipo-valuation-mergers-acquisitions-spree\/",
    "content":"\n<p>Spanish operator Cirsa has announced an offering price of €15 per share for its upcoming IPO, aiming for a total market valuation of €2.5 billion ($2.9 billion).<\/p>\n\n\n\n<p>In June, <a href=\"https:\/\/igamingbusiness.com\/strategy\/cirsa-ipo-launch-spanish-stock-exchanges\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cirsa announced its intention for an IPO<\/a> on Spanish stock exchanges, after months of rumours within the industry. <\/p>\n\n\n\n<p>At the time, the company said it expected to raise €400 million, with the hopes this will aid the business to continue its aggressive M&amp;A strategy which has seen Cirsa complete over 130 acquisitions since 2015.<\/p>\n\n\n\n<p>The IPO is still subject to approval by the Spanish National Securities Market Commission, with the offering set to begin once approval of Cirsa’s prospectus is completed.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.cirsa.com\/files\/CIRSA_PRICE_Announcement.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">The company will offer 26,666,667 newly issued shares<\/a> in its primary offering, equating to €400 million at its IPO.<\/p>\n\n\n\n<p>Meanwhile, its secondary sale, which will be held solely for the indirect benefit of certain current and former employees, is set to be conducted by LHMC Midco and will offer 3,552,113 existing shares, equivalent to around €53 million.<\/p>\n\n\n\n<p>LHMC Midco will also grant an over-allotment option to the stabilising manager Morgan Stanley Europe, which will be able to acquire up to 4,532,817 additional shares within 30 days of the commencement of trading on the Spanish stock exchanges.<\/p>\n\n\n\n<p>This means the maximum offer size will be 34,751,597 shares, worth €521 million in total.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-what-does-cirsa-hope-to-achieve-with-its-ipo\"><strong>What does Cirsa hope to achieve with its IPO?<\/strong><\/h2>\n\n\n\n<p>Cirsa’s announcement of its long-rumoured IPO comes with the <a href=\"https:\/\/igamingbusiness.com\/finance\/cirsa-peru-portugal-integrations-record-q1-revenue\/\" target=\"_blank\" rel=\"noreferrer noopener\">company performing impressively<\/a>, growing its EBITDA for 67 consecutive quarters when excluding those impacted by Covid-19.<\/p>\n\n\n\n<p>Having been <a href=\"https:\/\/igamingbusiness.com\/casino-games\/blackstone-acquires-spains-cirsa\/\" target=\"_blank\" rel=\"noreferrer noopener\">acquired by Blackstone<\/a> in 2018, Cirsa now holds a presence in 11 global markets, having entered both Peru and Portugal in the last couple of years thanks to acquisitions.<\/p>\n\n\n\n<p>It is this M&amp;A strategy that Cirsa hopes to continue via its IPO. The €400 million equity raise could accelerate the company’s growth strategy and strengthen its capital structure.<\/p>\n\n\n\n<p>Between 2025 and 2027, Cirsa plans to strengthen its M&amp;A investment capacity, supported by organic cash flow generation of €400 million-€500 million.<\/p>\n\n\n\n<p>Cirsa CEO Antonio Hostench said: “We are taking a defining step to continue writing another page in this extraordinary history of growth by announcing our intention to go public, which will provide us with the opportunity to undertake new projects and continue to consolidate our leadership in the sector.”<\/p>\n"
  },
  {
    "title":"Here&#8217;s a recap of this session&#8217;s Nevada legislation impacting the gaming industry",
    "date":"2025-07-01T19:09:07",
    "link":"https:\/\/cdcgaming.com\/recap-of-nevada-legislation-impacting-gaming-industry\/",
    "content":"<p>The Nevada Legislature wrapped up its session in June. Some bills impacting the gaming industry went into effect Tuesday; others will go into force at a later date.<\/p>\n<p>Senate Bill 459 came out of a Nevada Gaming Control Board workshop held in December, with the backing of the Nevada Resort Association. The goal was to make it easier for the public to access high-end gaming salons. There’s no longer a $500-minimum wager to play slots. Instead, casinos can set minimum wagers approved by the Gaming Control Board. The salons are no longer required to include table games.<\/p>\n<p>Gaming-salon regulations have been in effect for 24 years and the intent is to make them more accessible to the public when not in private use as a way to attract more visitors and generate more revenue. That bill is in effect.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-769476415\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-4055603626\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/105836\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"719\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"mindwaybanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Mindway-web-250708.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('mindwaybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Mindway-web-250708.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 719;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div><\/div>\n<p>“We want to make salons more appealing for guests and operators,” said Virginia Valentine, CEO of the Nevada Resort Association. “One of the things that came out of that workshop was that a $500 minimum was pretty high, and that there wasn’t the same appetite for table games as slot machines. We feel like it’s going to expand the opportunities in salons and attract players who may be playing in private card rooms (and tribal casinos) in California. We think it will attract some new visitors and also enhance the experience for visitors who may want more security or more privacy.”<\/p>\n<p>Currently, the financial criterion for admission to a gaming salon includes an up-front deposit of at least $300,000, a $300,000 line of credit, or a combination of the two totaling at least $300,000. The industry would like to see that price of entry reduced or eliminated.<\/p>\n<p>Those limits are at the discretion of the Gaming Control Board and Gaming Commission, Valentine said. She expects a workshop to be held in the near future on the issue.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-4200183095\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/45076\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"koinbanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Koin-web-250228.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('koinbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Koin-web-250228.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script>\r\n\r\n<\/a><\/div>\n<p>“Right now, it&#8217;s a pretty narrow audience for salons,” Valentine said. “You want to maintain that surveillance and security, but you also want to offer these salon experiences to high-value players and not necessarily people who are going to lose a half-million dollars.”<\/p>\n<p>Senate Bill 256, which goes into effect Oct. 1, requires the disgorgement of profits from illegal gaming activities and increases penalties. The legislation was in response to prediction markets, sweepstakes operators, and other online companies functioning in the state without a gaming license. The money will go into the state’s general fund as part of court action.<\/p>\n<p>Nevada has sent cease-and-desist letters to sweepstakes and prediction-market operators. State gaming regulators have been locked in a legal battle with financial exchange Kalshi, which offers contracts on sports and receives a fee. Nevada’s Kalshi cease-and-desist order has been halted by a federal judge.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1853894474\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/109793\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"Excel Dryer web 250721\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721.jpg\" alt=\"\"  srcset=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721.jpg 720w, https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721-375x86.jpg 375w\" sizes=\"(max-width: 720px) 100vw, 720px\" class=\"no-lazyload\" width=\"720\" height=\"166\"   \/><\/a><\/div>\n<p>“The bill was really targeted toward sweepstakes,” Valentine said. “A number of states across the country are outlawing sweepstakes, which are illegal gaming and unregulated. What the disgorgement does is add an extra disincentive to operating illegally here. If they have to forfeit all the profits to the state, that’s a bigger disincentive than fines. You see this around the country.”<\/p>\n<p>Assembly Bill 58, which went into effect Tuesday, allows approval by the chair of the Gaming Control Board for games and gaming devices, streamlining the process. It enables new gaming devices to be on the floor as fast as 50 to 60 days in some circumstances. That includes traditional table games and gaming devices. Previously, the process required Commission approval.<\/p>\n<p>Despite the change, the games still go through the same rigorous testing process, according to Sebastian Ross, a senior policy counsel for the Board.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-555389862\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/72800\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"trustlybanner\"  role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Trustly-web-250701.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('trustlybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Trustly-web-250701.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>Also effective Tuesday, Senate Bill 46 provides parameters for the Gaming Control Board to maintain jurisdiction and investigate and initiate hearings to impose discipline for those who were licensed and found suitable by the Board and Commission. The Board will be submitting regulations for the Commission to adopt, Ross said.<\/p>\n<p>The new law allows fines of not more than $500,000 for each separate violation that is the subject of an initial complaint, and $1 million for each separate violation that is the subject of a subsequent complaint. Existing law established fines of not more than $100,000 for certain violations and not more than $250,000 for each separate violation.<\/p>\n<p>“They raised the statutory-fine range for violations of the Nevada Gaming Control Act,” Ross said. “When it comes to the increase of the fine ranges, it’s going to be up to the Nevada Gaming Commission to determine what the amount is. One of the things we&#8217;ve seen in recent months is agreements that go above the fine threshold. The licensee will still have the ability to negotiate with the Board those settlements, but ultimately it will be for the Commission to approve.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-269297138\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14527\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"120\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"nanoptixbanner\"  role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/01\/Nanoptix-web-250130.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('nanoptixbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/01\/Nanoptix-web-250130.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 120;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>Senate Bill 203 provides legal immunity to the Nevada Gaming Commission and related entities for good-faith actions and clarifies that off-track pari-mutuel systems and operators don&#8217;t need to be physically present in Nevada under certain conditions.<\/p>\n<p>“It eliminates the need for a track to enter into an agreement with a disseminator,” Ross said. “The track can go directly with a book now.”<\/p>\n"
  },
  {
    "title":"CDC Gaming Roundtable: In five years, the gaming industry landscape will be different",
    "date":"2025-07-01T19:00:35",
    "link":"https:\/\/cdcgaming.com\/cdc-gaming-roundtable-in-five-years-the-gaming-industry-landscape-will-be-different\/",
    "content":"<p>In 2020, the gaming industry landscape looked remarkably different.<\/p>\n<p>Legal sports betting was only two years old and operators spent enormous sums of money vying for customers. Cashless payments were a trendy new development that seemed on the verge of widespread adoption. And almost no one had heard of sweepstakes or prediction markets.<\/p>\n<p>Flash forward to 2025: The number of sports betting operators has been winnowed, with clear winners, including DraftKings and FanDuel, now the market leaders. The adoption of cashless payment systems has progressed steadily but is still not widespread. And sweepstakes and prediction markets are currently hot-button issues in the industry that were largely unknown in 2020.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1202881445\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/97541\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"conjointlybanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Conjointly-web-250318.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('conjointlybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Conjointly-web-250318.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script>\r\n\r\n<\/a><\/div>\n<p>In five years, the gaming industry will likely reflect similar change, some not yet apparent.<\/p>\n<p>CDC Gaming recently hosted a roundtable on what the gaming industry will look like in 2030. Three industry insiders took part: Dr. Laila Mintas, an entrepreneur and strategic advisor; Daniel Wallach, U.S. gaming law and sports betting attorney; and Anne Hay, PayNearMe Executive Vice President and CMO.<\/p>\n<p>Mintas said it’s instructive to look back at where the gaming industry stood in 2020 before looking ahead. She recalled that operators were in the midst of a “gold rush” regarding the then two-year-old repeal of the Professional and Amateur Sports Protection Act (PASPA), and that “no one really cared about user acquisition costs. People were spending like there’s no tomorrow.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-376193926\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-911363853\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14497\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"smokefree-customers-preferences-720&#215;90-1.gif\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2022\/09\/smokefree-customers-preferences-720x90-1.gif\" alt=\"\"  class=\"no-lazyload\" width=\"720\" height=\"90\"   \/><\/a><\/div><\/div>\n<p>In five years, Mintas says, expect chaos to continue.<\/p>\n<p>“As of today, we have seven states in the U.S. that have online casino and I think this regulatory environment left a big gap in the market,” Mintas said. “That enabled the operators that you see that are now coming in and disrupting, if you can speak even from disruption, because the market is still so young. But you see crypto.com coming in. You see all the sweepstakes coming in. You see the prediction markets, like the Kalshi’s of the world.<\/p>\n<p>“There&#8217;s so much going on right now in the market. I think in five years from now, or in the next five years, we will see a lot of legal cases and fights and about who gets what share of that big pie. And it will probably get pretty, pretty heated. And I think there will be new operators and new businesses coming in, trying to ban existing regulations, using loopholes, trying to regulate in a different way.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3872096115\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/74715\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"Vector Solutions web 250714\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/07\/Vector-Solutions-web-250714.jpg\" alt=\"\"  srcset=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/07\/Vector-Solutions-web-250714.jpg 720w, https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/07\/Vector-Solutions-web-250714-375x93.jpg 375w\" sizes=\"(max-width: 720px) 100vw, 720px\" class=\"no-lazyload\" width=\"720\" height=\"178\"   \/><\/a><\/div>\n<p>Wallach said the repeal of PASPA paved the way for unanticipated actions that are now reverberating. He said that Native American tribes are now using the Indian Gaming Regulatory Act to advance online gaming; that daily fantasy contests have expanded to include player proposition bets; that sweepstakes have emerged, and the Commodity Futures Trading Commission (CFTC) is now the regulator for the sports prediction market.<\/p>\n<p>The repeal of PASPA not only created a regulated marketplace but also incentivized some individuals and companies to look for shortcuts.<\/p>\n<p>“We’re now redefining what a bet is, what a wager is, what is an entry fee, what&#8217;s a contest, what&#8217;s a game of skill, what&#8217;s a game of chance, what&#8217;s a commodity,” Wallach said. “It&#8217;s all part of a common thread of the significant financial upside associated with gaming, creating ingenuity.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1563676869\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/42414\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"lockdogsbanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Lockdogs-web-150718.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('lockdogsbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Lockdogs-web-150718.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>“They call it innovation, but in many ways, it&#8217;s a workaround or a loophole that&#8217;s being exploited based on either actual or perceived gaps in the law. And I don&#8217;t know that this represents a safe opportunity for investment. I think there&#8217;s a lot of volatility in play here because each of these expanded areas, saved for tribal digital gaming, has attracted significant scrutiny from states and from courts, and it is a very uncertain investment climate. The one thing I do know is that there will always be something else. There will be something else to come in that we didn&#8217;t see today.”<\/p>\n<p>Hay says the payments space is rife with legacy platforms that were “falling short” and that inefficiencies are abundant. PayNearMe has worked to rectify those shortcomings and foresees new payment types emerging in the near future.<\/p>\n<p>She notes that PayNearMe consistently receives inquiries about using cryptocurrencies as a form of payment. Hay said that the recent FiServ announcement that it is launching a stablecoin for banks opens up a new avenue that players may embrace, especially since there are a lot of fraud and risk controls associated with the development.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1822195667\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14492\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"90\" fullscreen=\"false\" playsinline playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"player\"  role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/02\/CDC-Consulting-web-banner-240202.mp4\"type=\"video\/mp4\">\r\n<\/video><\/a><\/div>\n<p>“This payment has a potential to be faster and cheaper,” Hay said. “And it’s not even five years out &#8212; I think that&#8217;s going to be even sooner. And things like stablecoin also seem to have a tighter set of controls, because the banks are behind it. And so, I expect that will be favorable for regulators and things like that.”<\/p>\n<p>The increased use of artificial intelligence in gaming also seems to be inevitable, although Mintas admits, “our industry is not the most innovative industry.”<\/p>\n<p>‘But I think we will be like a target zone, because most of the gambling industry, at least that I&#8217;m dealing with, is online,” Mintas says. &#8220;So, it&#8217;s perfect. It&#8217;s perfect to be targeted for AI products.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3905424080\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/84481\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"120\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"quixantbanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Quixant-web-250310.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('quixantbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Quixant-web-250310.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 120;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>Hay considers AI to be the prototypical buzzword. Every company in the gaming industry is either using AI or discussing how to use artificial intelligence, but no one has figured out how best to deploy it.<\/p>\n<p>She notes that PayNearMe is currently experimenting extensively with AI. Hay suggests that in the near future, companies should “lean into it” and hire experts instead of trying to grapple with AI on their own. There are indications, at least in the payments space, that AI will be beneficial.<\/p>\n<p>“We&#8217;re seeing some promising signs where it&#8217;s helping operate or sort of increase those acceptance rates,” Hay said, “and ultimately just provide a better experience for players and removing some of those barriers to completing deposits or withdrawals.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2180537962\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/23931\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"90\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"player\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2023\/01\/Sixteenfifty-web-230131.mp4\" type=\"video\/mp4\">\r\n<\/video><\/a><\/div>\n<p>Sweepstakes and prediction markets, however, loom large on the horizon. While many states, including Michigan, Louisiana, New York, Mississippi, and California, have issued cease-and-desist orders to companies hosting sweepstakes games and prediction markets, Kalshi, notably, has resisted any impediments to doing business.<\/p>\n<p>Kalshi, regulated by the CFTC, currently can operate in all 50 states, claiming it doesn’t offer gambling.<\/p>\n<p>According to Wallach, Kalshi and other prediction market companies insist that because they are regulated by the CFTC, they are able to operate.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2331800552\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14518\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"galaxybanner\"  role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Galaxy-Gaming-web-250718.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('galaxybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Galaxy-Gaming-web-250718.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>“I think under a traditional preemption analysis, I think the states do have the better argument,” Wallach says. “But I think the ultimate trump card here, no pun intended, belongs to the Trump administration, because even if the states win, which is maybe potentially in a year to two years of a dog fight in the federal courts, as long as Trump retains control over our Congress, the administration&#8217;s response to a loss in court could simply be to usher in statutory amendments to the Commodity Exchange Act, to make clear or to clarify that sweepstakes and commodities can include event contracts tied to real world.”<\/p>\n"
  },
  {
    "title":"Apollo closes IGT and Everi deal",
    "date":"2025-07-01T11:07:35",
    "link":"https:\/\/cdcgaming.com\/apollo-closes-igt-and-everi-deal\/",
    "content":"<p>Apollo Global management announced Tuesday the completion of its acquisitions of International Game Technology’s gaming and digital business and Everi Holdings Inc.<\/p>\n<p>The sale, which will to take the combined gaming companies private, follows votes last week by the Nevada Gaming Commission; the Commission signed off on the deal, valued at $6.3 billion.<\/p>\n<p>IGT and Everi will be integrated into a combined company in the coming months. Headquartered in Las Vegas, the enterprise will operate under the IGT name, while retaining the Everi brand in select markets and product lines.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-426618865\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3322026384\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/56214\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"650\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"player\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/01\/Next-Gaming-web-240117-3.mp4\" type=\"video\/mp4\">\r\n<\/video><\/a><\/div><\/div>\n<p>IGT will be organized into three business units: Gaming, Digital, and FinTech, creating a customer-first enterprise supported by a people-first culture that values talent, collaboration and innovation, according to IGT Interim CEO Nick Khin.<\/p>\n<p>“This is a defining moment for our industry,” Khin said. “By uniting two leading organizations, we’re building an enterprise with the scale, talent, and technology to lead the future of gaming. With Apollo’s support, we’re well-positioned to deliver exceptional content across land-based and digital experiences, along with integrated financial solutions and casino management that enhance the player journey and drive value for our customers.”<\/p>\n<p>Hector Fernandez is expected to assume the role of CEO of IGT during the fourth quarter, following the expiration of a non-compete period with Aristocrat. Until then, Khin will lead the organization and transition into the role of CEO of IGT’s Gaming business unit upon Fernandez’s arrival.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2505147690\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/107546\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"Print\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/06\/Plastic-Graphics-email-web-250626.jpg\" alt=\"\"  srcset=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/06\/Plastic-Graphics-email-web-250626.jpg 720w, https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/06\/Plastic-Graphics-email-web-250626-375x94.jpg 375w\" sizes=\"(max-width: 720px) 100vw, 720px\" class=\"no-lazyload\" width=\"720\" height=\"180\"   \/><\/a><\/div>\n<p>“Bringing together highly complementary businesses creates a more competitive, agile, and well-capitalized platform built for long-term growth,” said Daniel Cohen, a partner at Apollo. “IGT is well positioned to deliver differentiated content and capabilities that better serve customers across the globe.”<\/p>\n<p>Effective Tuesday, Everi common stock has been delisted from the New York Stock Exchange. Everi stockholders are receiving $14.25 per share in cash and International Game Technology is receiving $4.05 billion of cash proceeds.<\/p>\n"
  },
  {
    "title":"Ohio casino revenue increases 8.4% year-over-year in May",
    "date":"2025-07-01T11:03:52",
    "link":"https:\/\/cdcgaming.com\/ohio-casino-revenue-increases-8-4-year-over-year-in-may\/",
    "content":"<p>Ohio casinos generated $91.6 million in revenue in May, an 8.4% rise year-over-year and a 3.5% increase from the $88.5 million in casino revenue generated the month prior.<\/p>\n<p>The Ohio Casino Control Commission <a href=\"https:\/\/dam.assets.ohio.gov\/image\/upload\/v1740767451\/casinocontrol.ohio.gov\/revenue-reports\/2025\/2025_Ohio_Casino_Monthly_Revenue_Report.pdf\">report<\/a> revealed that Hollywood Columbus Casino collected the most revenue in May of the four licensed casinos. Its revenue of $25.8 million was 9.3% higher than the $23.6 million generated in May 2024.<\/p>\n<p>Hollywood Columbus Casino topped $25 million in revenue for the third straight month after generating $25.2 million in <a href=\"https:\/\/cdcgaming.com\/ohio-casino-revenue-down-3-4-year-over-year-in-april\/\">April<\/a> and $26.6 million in March. The casino only cleared that bar once in all of 2024 in March.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-884589239\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-137558719\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14551\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"QCI-web-220301-4.gif\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2022\/09\/QCI-web-220301-4.gif\" alt=\"\"  class=\"no-lazyload\" width=\"720\" height=\"90\"   \/><\/a><\/div><\/div>\n<p>Jack Cleveland Casino added the next most revenue to the state-wide total in May, generating $22.3 million, up 4.6% compared to May 2024.<\/p>\n<p>The other two casinos in the state brought in similar revenue totals, with Hard Rock Cincinnati bringing in $22.2 million and Hollywood Casino Toledo Casino generating $21.4 million. Those figures were increases of 8.4% and 11.3%, respectively.<\/p>\n<p>Most of statewide revenue in May came from slots, which generated $68.4 million, while table games added $23.3 million.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2743657673\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/40783\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"99\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"passportbanner\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/06\/Passport-web-240611.mp4\" type=\"video\/mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('passportbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/06\/Passport-web-240611.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 99;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n"
  },
  {
    "title":"Galaxy Gaming enters multi-year licensing agreement with Hasbro for table games",
    "date":"2025-07-01T10:58:59",
    "link":"https:\/\/cdcgaming.com\/galaxy-gaming-enters-multi-year-licensing-agreement-with-hasbro-for-table-games\/",
    "content":"<p>Galaxy Gaming on Monday announced it has entered into a multi-year licensing agreement with Hasbro to bring the game manufacturer’s games to casino table game pits.<\/p>\n<p>Galaxy Gaming will develop and distribute casino table games based on Hasbro&#8217;s world-famous titles, including <em>Monopoly, Yahtzee,<\/em> and <em>Battleship.<\/em><\/p>\n<p>“We are beyond excited to bring some of the best-loved brands to table games players around the world,” Galaxy Gaming President and CEO Matt Reback said in a statement. “This new deal is a testament to Galaxy’s singular focus on table games and our commitment to enhancing the base games players know and love, with innovative new game play experiences. <em>Monopoly, Yahtzee,<\/em> and <em>Battleship<\/em> have thrilled generations of players, and we look forward to translating the fun and excitement of these games into new and entertaining casino experiences.”<\/p>\n<p>Earlier Monday, Aristocrat Gaming announced it had earned the rights to develop Hasbro’s Monopoly games into slots.<\/p>\n<p>According to a news release, the partnership marries Galaxy Gaming&#8217;s “expertise in creating thrilling casino experiences with the nostalgic joy and distinctive excitement of Hasbro&#8217;s beloved global brands.”<\/p>\n<p>“At Hasbro, we’re passionate about play in all its forms—from game nights to authentic casino experiences,” said Hasbro Director of Gaming Relationships Claire Hunter Gregson. “After an extensive RFP (request for proposal) process, we’re excited to select Galaxy Gaming as our exclusive partner for branded table games. Galaxy’s expertise in this space makes them the ideal team to bring our iconic brands to casino floors in dynamic and compelling ways. We can’t wait to see what we’ll create together.”<\/p>\n<p>The first games under this licensing agreement are expected to debut at Global Gaming Expo 2025 and will begin appearing in casinos in early 2026.<\/p>\n"
  },
  {
    "title":"Aristocrat wins right to create Monopoly slot games",
    "date":"2025-07-01T09:36:14",
    "link":"https:\/\/cdcgaming.com\/aristocrat-wins-right-to-create-monopoly-slot-games\/",
    "content":"<p>Aristocrat Gaming and Hasbro announced today that Aristocrat Gaming is the winner of a competitive request for proposal (RFP) to create Monopoly slot games for worldwide land-based gaming venues, securing a multi-year agreement.<\/p>\n<p>“To be selected as Hasbro’s land-based slots partner – after a highly competitive process – is a proud milestone for Aristocrat Gaming,” said Aristocrat Gaming CEO Craig Toner in a statement. “Our commitment to innovation and bold creativity sets us apart, and we’re excited to reimagine Monopoly slot games for today’s players around the globe.”<\/p>\n<p><center><iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https:\/\/www.youtube.com\/embed\/0kxRQcOmXkg?si=xx9kMgkWwgGtmZ_i\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/center><\/p>\n<p>The landmark partnership allows Aristocrat Gaming to launch all-new Monopoly-themed slot titles beginning in early 2026.<\/p>\n<p>“It was evident through our selection process that Aristocrat Gaming was the natural fit for the next evolution of the Monopoly brand in the gaming category,” said Hasbro Director, Gaming Relationships Claire Hunter Gregson. “We can’t wait for Monopoly fans to experience all new premium gaming content on casino floors.”<\/p>\n"
  }
]