[
  {
    "title":"BoyleSports kickstarts £100m UK relaunch with West Ham sponsorship",
    "date":"2025-07-01T14:33:53",
    "link":"https:\/\/igamingbusiness.com\/marketing-affiliates\/sponsorship\/boylesports-kickstarts-100m-uk-relaunch-with-west-ham-sponsorship\/",
    "content":"\n<p>BoyleSports has announced a £100 million-plus relaunch in the UK, led by a high-profile shirt sponsorship of Premier League club West Ham United.<\/p>\n\n\n\n<p>More than 200 new shops will open across the UK, alongside significant technology upgrades to the BoyleSports sportsbook.<\/p>\n\n\n\n<p>The Ireland-headquartered bookmaker will invest the nine-figure sum in its UK business over the next three years. A BoyleSports spokesperson said the business is currently finalising the pipeline of new store locations in the UK.<\/p>\n\n\n\n<p>BoyleSports said the relaunch comes after two years of planning since the arrival of chief executive Vlad Kaltenieks. Ahead of Tuesday’s announcement, the business has made a series of senior appointments, including the addition of Troy Cox as chief commercial officer.<\/p>\n\n\n\n<p>Kaltenieks said: “This relaunch marks a major milestone for BoyleSports as we bring over four decades of betting expertise to a new era in the UK. The UK is one of the most exciting, well-regulated, and competitive betting landscapes in the world and we believe we offer something genuinely different to customers.<\/p>\n\n\n\n<p>“As a family-owned, independent business, we’ve built a loyal customer base in Ireland by focusing on trust, service and a seamless omnichannel experience – and now we’re rolling that approach out even more widely across the UK.<\/p>\n\n\n\n<p>“We’ve listened to what our customers have told us they want and with £100+ million committed to team, innovation, retail expansion and product development, we’re investing in the future of betting and staking our claim as a major player in the UK market.”<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-boylesports-acts-on-customer-feedback\">BoyleSports acts on customer feedback<\/h2>\n\n\n\n<p>BoyleSports said the investment will target areas based on feedback from its current customer base, including upgraded technology to bolster its digital offering.<\/p>\n\n\n\n<p>The 200 new UK stores will create over 1,000 new roles, building on its existing presence on the UK high street. The company says this reinforces its commitment to local communities and long-term growth in the market. The business currently runs 70 shops in the UK, with 290 in the Republic of Ireland.<\/p>\n\n\n\n<p>As it replaces Betway as West Ham’s front-of-shirt sponsor, CCO Cox said: “West Ham is one of the most iconic clubs in the Premier League and our partnership marks a powerful alignment between two proud, ambitious brands. We both have deep historic roots and a commitment to our communities to succeed at the highest level, making them a natural partner for us.”&nbsp;<\/p>\n\n\n\n<p>As part of the relaunch, BoyleSports is also unveiling a new brand identity that signals its ambition for the UK market.<\/p>\n\n\n\n<p>A group spokesperson said: “The refreshed look includes a modernised logo, streamlined typography and a new colour palette designed to stand out across both digital and retail environments. It reflects a sharper focus on intuitive tech and user experience and a more rewarding customer promise built around personalised offers, expert insight and great service across every touchpoint.”<\/p>\n"
  },
  {
    "title":"Legacy lotteries are at risk of cannibalisation from prize draws",
    "date":"2025-07-01T10:18:55",
    "link":"https:\/\/igamingbusiness.com\/lottery\/lottery-prize-draws-uk-cannibalisation-innovation\/",
    "content":"\n<p>Today it is nigh on impossible to scroll through social media apps without being hit by a targeted ad for a “chance to win a million-pound house” in the UK. The likes of Omaze and Raffle House have taken the lottery sector by storm, after the prize draw vertical seemingly appeared out of nowhere a couple of years ago.  <\/p>\n\n\n\n<p>But in a Q3 gambling activity update from the Gambling Commission, player data suggested these prize draw offerings could be cannibalising traditional lotteries in the UK. “We’ve seen the growth of large-scale prize draws and that growth has been very significant,” <a href=\"https:\/\/igamingbusiness.com\/lottery\/free-prize-draws-cannibalization-gsgb-uk-gambling-participation-q3\/\" target=\"_blank\" rel=\"noreferrer noopener\">Gambling Commission CEO Andrew Rhodes told attendees of the Betting and Gaming Council’s AGM<\/a> on 27 February. &nbsp;<\/p>\n\n\n\n<p>He noted that prize draw products are experiencing a participation level that is much higher than that of other gambling products, or products regulated as gambling. “It’s getting close to being on a par with betting in terms of participation, also in terms of the average spending,” Rhodes said.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-should-prize-draws-be-regulated-alongside-lottery-nbsp\"><strong>Should prize draws be regulated alongside lottery?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The UK Lotteries Council, a body that represents the sector, has called for a re-evaluation of the currently largely unregulated prize draw vertical. It should fall under traditional lottery regulations, it says. “If there is a shift from society lotteries to unregulated prize draws, returns to good causes will inevitably decline. &nbsp;<\/p>\n\n\n\n<p>Million-pound prize draws represent the thin end of the wedge in lottery-based civil society fundraising,” Lotteries Council chair Tony Vick wrote in a March report on prize draws and charity lotteries. But James Miéville, executive director at Raffle House, a prize draw operator in the UK, says he does not believe the product is in competition with the National Lottery, as it is instead an entirely new demographic of players.  <\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/a8n7k_fnuoypyWYn6zOOpysip0LgX9p0D_GpSPpRfD8\/resizing_type:auto\/width:0\/height:1024\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9KYW1lcy1NaWV2aWxsZS1oZWFkc2hvdC1sb3R0ZXJ5LWZlYXR1cmUuanBn.webp\" alt=\"\" class=\"wp-image-384685\" style=\"width:303px;height:auto\"\/><figcaption class=\"wp-element-caption\">James Miéville of prize draw operator Raffle House says the vertical is not in competition with the UK national lottery<\/figcaption><\/figure><\/div>\n\n\n<p>“We believe companies such as ours have tapped into a previously unmet demand and that this has attracted new players rather than pulling players away from other products,” says Miéville. “Our player data suggests the audience for house prize draws is more diverse than that of lotteries.”  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-free-to-enter\">&#8216;Free to enter&#8217;<\/h2>\n\n\n\n<p>Today, prize draws offer a “free to enter” option, whereby players can send in an entry to a draw, only paying to send the entry. This means the vertical is exempt from falling under lottery rules as per the Lotteries Act. Also writing in the Lotteries Council report, Member of Parliament for Aldridge-Brownhills Wendy Morton warned these new games had become “indistinguishable” from charity lotteries, which are required to meet strict standards, like not offering large prizes or jackpots and paying back a certain percentage of earnings to charity.<\/p>\n\n\n\n<p>The case against prize draws, which are typically offering multimillion-pound prizes to players, is clear: they should be properly regulated, so the traditional lottery sector claims. <\/p>\n\n\n\n<p>In <a href=\"https:\/\/igamingbusiness.com\/legal-compliance\/compliance\/uk-government-voluntary-code-prize-draws-and-competitions\/\" target=\"_blank\" rel=\"noreferrer noopener\">a speech to parliament last week, Gambling Minister Baroness Twycross<\/a> said the vertical would not be placed under the Lottery Act regulations but rather a voluntary code which will seek to unify the vertical’s approach across the sector. <\/p>\n\n\n\n<p>Richard Williams, partner at Keystone Law, told&nbsp;iGB&nbsp;he expects a monitoring period of at least a year for prize draws, to assess whether any measures are successful. He said the code was largely an attempt to avoid introducing legislation.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-healthy-competition-nbsp\"><strong>Healthy competition<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Others in the lottery sector support the innovation behind the new vertical; after all, it is clearly appealing to a new demographic that more traditional lotteries have ignored for decades. Could this feud be exactly what lotteries need to reinvigorate the industry?&nbsp;<\/p>\n\n\n\n<p>“I get the impression that some players in the industry are trying to fight the competition through politics here, and I would say that’s not wise,” Helmut Becker, longstanding CEO for German lottery provider Zeal Network, tells iGB. <\/p>\n\n\n\n<p>“They should focus on innovation in their own business. I do think generally speaking there’s an opportunity for more innovation in our industry.” Becker laments the slow uptake of online lottery offerings. “The internet penetration in the lottery industry is relatively low, particularly in Germany where we are at 25%,” he says. &nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"2560\" src=\"https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-scaled.jpg\" alt=\"Zeal CEO Helmut Becker\" class=\"wp-image-378925\" style=\"width:387px;height:auto\" srcset=\"https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-scaled.jpg 2560w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-300x300.jpg 300w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1024x1024.jpg 1024w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-150x150.jpg 150w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-768x768.jpg 768w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1536x1536.jpg 1536w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-2048x2048.jpg 2048w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-650x650.jpg 650w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1300x1300.jpg 1300w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" \/><figcaption class=\"wp-element-caption\">Zeal CEO Helmut Becker urges lotteries not to stifle innovation from new verticals<\/figcaption><\/figure><\/div>\n\n\n<p>He goes on to compare the sector to other entertainment offerings like concerts, or even transportation services that offer tickets online for trains and buses. “Those industries have much higher rates of digital penetration. I see tremendous growth potential in the lottery industry converting from offline to online. There’s this continuous optimisation in ecommerce best practice [that we could&nbsp;learn from].” &nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-we-ve-seen-this-response-nbsp-before-nbsp\"><strong>We’ve seen this response&nbsp;before<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Zeal rode the wave of lottery betting (or&nbsp;lottery brokerage) solutions as the novel opportunity arose in 1999. <\/p>\n\n\n\n<p>Operators like Zeal and Lottoland offered players a chance to participate in mammoth jackpots, by betting on lottery draws around the world instead&nbsp;of just their national or state-run&nbsp;offering. In the beginning of this wave, operators were heavily scrutinised and many called for new regulations to clamp down on the spread of these types of offerings, similar to the fight against prize draws today. &nbsp;<\/p>\n\n\n\n<p>But Becker argues there is a need among younger and female demographics for new and novel solutions within lotteries. “There are new target groups, other target groups than the traditional lottery player, younger target groups, female target groups. And there are ways to address the needs of those target groups and that’s through product innovation. Creating new types of lotteries or new types of games like Dream House raffle, for example, unlocks another layer of growth [for operators],” he says. <\/p>\n\n\n\n<p>Zeal has both invested in and developed an in-house version of a prize draw offering but offered under a charity lottery licence, and Becker suggests it is this agility and commitment to innovation that has powered Zeal’s progressive growth in recent years.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/igamingbusiness.com\/finance\/full-year-results\/net-profit-record-2024-zeal\/\" target=\"_blank\" rel=\"noreferrer noopener\">In its full-year 2024 results, Zeal posted a record group revenue<\/a> of €188.2 million ($203 million), beating the previous year by 62.2%. It also saw bottom-line net profit rise 333.2% to €59.4 million. On this trajectory, Becker says the company has continuously optimised and grown its core business while making constant improvements in ecommerce, ensuring excellence in unit economics, efficiently allocating marketing spend and ultimately improving the customer lifetime value of its loyal customer base. There is clearly still demand for more traditional lottery betting offerings.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-can-it-cross-sell-nbsp\"><strong>Can it cross-sell?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>In the US, lottery courier services have exploded in the market. These offerings enable players to participate in draws operating in multiple states by buying tickets for different draws and enabling&nbsp;players to purchase them via the product. In February, <a href=\"https:\/\/igamingbusiness.com\/strategy\/draftkings-2025-guidance-lottery-inplay-betting\/\" target=\"_blank\" rel=\"noreferrer noopener\">DraftKings CEO Jason Robins talked up its 2024 acquisition of lottery betting app Jackpocket<\/a>, insisting the product was already proving a valuable customer acquisition and cross-sell tool.&nbsp;<\/p>\n\n\n\n<p>&nbsp;“Jackpocket has been great in terms of both cross-sell and, also, we have had really strong customer acquisition during its last $1 billion jackpot run. I do think that there’s room to invest more there,” Robins told analysts in its Q1 earnings call. &nbsp;<\/p>\n\n\n\n<p>“For us, it’s probably more effective in states where there’s legal sports betting and iGaming because the LTVs (lifetime value) in the immediate term are going to be higher because we can cross-sell right away.”&nbsp;<\/p>\n\n\n\n<p>He compared the product to DFS in terms of player acquisition opportunity, and of course it was DFS that helped skyrocket the likes of DraftKings and FanDuel to the top positions for both betting and iGaming in the States. But Becker says he is less certain of lottery’s cross-sell capabilities. &nbsp;<\/p>\n\n\n\n<p>“The jury is out on how big the synergies between different forms of gambling are, and whether it is possible to capture them and how,” he comments. “I haven’t seen the data yet, so for me the case is not closed on the cross-sell opportunity between lottery players and other forms of gambling being as big as expected.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-lottery-and-igaming\">Lottery and iGaming<\/h2>\n\n\n\n<p>Nikolina Gabelica, head of lottery operations at EveryMatrix, supports Robins’ assertion that lottery games can be successful acquisition tools. “I worked for an operator previously, and it had a clear path to use lottery as an acquisition tool. It’s easier to acquire a player, but not to say it’s cheaper, with lottery games. And that’s including instant games and scratchcards. Yes, this is easier, less frequent and less aggressive play. But it was used for acquisition of the players,” she says. <\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/Lk_uhJJVUXo6u4m650ss14PN7eUfcHe2h9uFymRLFxk\/resizing_type:auto\/width:1024\/height:0\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9OaWtvbGluYS1HYWJlbGljYV9FdmVyeU1hdHJpeC5wbmc.webp\" alt=\"\" class=\"wp-image-384682\" style=\"width:506px;height:auto\"\/><figcaption class=\"wp-element-caption\">EveryMatrix&#8217;s Nikolina Gabelica believes lottery can be a good product to cross-sell to iGaming<\/figcaption><\/figure><\/div>\n\n\n<p>“Of course, not all lottery players would transition to sports betting or iGaming. But yes, that journey was a natural one [for players].” However she acknowledges that gamified lottery products offering unique bonuses or a novel element prompt longer gaming sessions and a higher chance for cross-sell capabilities.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-lottery-across-the-pond-nbsp\"><strong>Lottery across the pond<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The US is operating a dynamic and nuanced lottery sector, but like other verticals it is fragmented and many states still have a state-run lottery monopoly in place. Therefore, regulations are hugely outdated and largely do not support new multistate courier operations like Jackpocket. The vertical came under fire in February when a group of investors won two multimillion-dollar jackpots in Texas, after mass purchasing of tickets in bulk, which effectively hacked the system. <\/p>\n\n\n\n<p>The scandal resulted in harsh criticism around the lottery courier offering, and Texas moved to ban these services in the state. <a href=\"https:\/\/oppaga.fl.gov\/Products\/ReportList\" target=\"_blank\" rel=\"noreferrer noopener\">According to 2024 data from the Office of Program Policy Analysis and Government Accountability<\/a>, lottery betting was available in 19 US states last year.&nbsp;<\/p>\n\n\n\n<p>“I think the US lotteries are concerned about it because they are finding themselves competing directly with very mighty private companies that are active in sports betting and iGaming,” Becker explains. “But I honestly don’t know how the US market will play out. I think it will be two steps forward, one step back. I think it will be very heterogeneous and be different in each state. &nbsp;<\/p>\n\n\n\n<p>“Oftentimes there’s no clear regulation for online sales. The courier model evolved because there is demand and somebody is just filling the gap. I think the problem is that there’s no good regulation in place to foster the well-regulated sales of online lottery tickets to customers.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-robust-regulation-is-crucial\">Robust regulation is crucial <\/h2>\n\n\n\n<p>Becker believes that, in order to maintain a thriving and innovative lottery sector, robust regulation is needed. And this is something that appears to be missing in the US. Germany, however, has robust lottery laws in place, he says. And having these laws in place has supported and encouraged the rise of new products and fresh innovations. &nbsp;<\/p>\n\n\n\n<p>He says the gambling regulator in Germany, the GGL, has determined clear boundaries for the lottery sector and this makes it easy for lottery brokerage operators like Zeal to adhere to the rules. “A well-regulated market fosters and incentivises good behaviour and growth. In the end, society benefits from that growth. I do think there’s an opportunity to strike a balance between a well-regulated and open market that is open to private players like us.”&nbsp;<\/p>\n\n\n\n<p>Many European markets also still operate lottery monopolies while others, like the UK and Italy, issue a tender for their national lottery. This is either won by a single lottery provider or a consortium of providers.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-all-change-for-lottery-in-the-uk-nbsp\"><strong>All change for lottery in the UK<\/strong>&nbsp;<\/h2>\n\n\n\n<p>In February 2024, global lottery provider Allwyn won the UK’s National Lottery tender, after almost 20 years of Camelot operating the programme. In securing the fourth licence, Allwyn saw off competition from a number of heavy hitters, including Camelot. However, the operator, which counts a number of European lottery companies under its belt, has faced criticism for failing to deliver on promises made during its successful bid for the lottery. &nbsp;<\/p>\n\n\n\n<p>Areas of concern to the Gambling Commission are said to include delays to digital upgrades. Allwyn is also said to have pledged to reduce ticket prices for the main National Lottery draw from £2 to £1, but this is yet to take place. In a statement issued to iGB, Allwyn said it is still committed to upgrading and modernising the system, with a planned spend of more than £350 million ($467 million) on improvements.  <\/p>\n\n\n\n<p>“Our investment will help restore the magic to The National Lottery,” Allwyn said. “But the shift from outdated systems is complex and requires robust testing. We will deliver essential upgrades over the coming year. We are working at pace to complete this transformation as soon as possible.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-can-lottery-keep-up-with-prize-draw-innovation\"><strong>Can lottery keep up with prize draw innovation?<\/strong><\/h2>\n\n\n\n<p>Allwyn shows it is harder to innovate in a legacy sector than some might believe. The outlook for lottery is positive. Becker believes there is much more to be achieved in the space, particularly in increasing the rate of digitisation. The demand for new lottery-style games will continue to grow as Gens Z and Alpha turn the appropriate age for playing these games. But national lotteries are certainly at risk of falling behind.&nbsp;<\/p>\n\n\n\n<p>“They’re setting a new standard for how play should feel,” Gabelica says of the “quick, easy experiences” of sweepstakes, crypto games and prize draws. “This is very difficult for lotteries to catch up [to]. And the risk is that if [these new games] change what players expect, and if the national lotteries don’t keep up, they will feel outdated, even if the prizes are much bigger,” she concludes.<\/p>\n"
  }
]