[
  {
    "title":"Macau gaming up 19% for June on strength of entertainment",
    "date":"2025-07-01T16:28:24",
    "link":"https:\/\/igamingbusiness.com\/finance\/full-year-results\/macau-gaming-june-revenue-increase-strength-entertainment\/",
    "content":"\n<p>The Macau casino industry finished June on a high note. Gross gaming revenue for the month came to MOP21.06 billion ($2.6 billion), up 19% year on year. Added to a robust performance in May – a 5% boost in GGR versus the consensus of 2.7% – it brings total GGR so far to MOP118.77 billion, up 4.4% over 2024.<\/p>\n\n\n\n<p>It’s a welcome development for the Asian gaming mecca, which <a href=\"https:\/\/igamingbusiness.com\/casino\/analysts-macau-on-the-way-to-full-recovery-by-26\/\" target=\"_blank\" rel=\"noreferrer noopener\">started the year strongly<\/a> only to see the momentum dwindle.<\/p>\n\n\n\n<p>Last year, anticipating a bump in tourism, government officials set a <a href=\"https:\/\/igamingbusiness.com\/casino\/macau-tourism-to-stoke-ggr-in-new-year\/\" target=\"_blank\" rel=\"noreferrer noopener\">GGR target of MOP240 billion<\/a> for 2025. Industry analysts were even more upbeat. Citi’s George Choi and Timothy Chau projected a 7% increase in GGR year-over-year, for a total of MOP244 billion.<\/p>\n\n\n\n<p>But those hopes soon dimmed. Following lacklustre revenues in January and February, the government <a href=\"https:\/\/igamingbusiness.com\/casino\/tourism\/macau-chief-executive-projected-revenue-gaming-slump\/\" target=\"_blank\" rel=\"noreferrer noopener\">adjusted its expectations<\/a> downward, resetting the yearly total to MOP228 billion.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-june-boost-tied-to-god-of-song\">June boost tied to ‘God of song’<\/h2>\n\n\n\n<p>June’s results put Macau on track to meet and surpass the government’s revised forecast – and all because of a 60ish crooner called the “Heavenly King of Cantopop”.<\/p>\n\n\n\n<p>According to <a href=\"https:\/\/www.macaubusiness.com\/june-gaming-revenue-jumps-19-pct-to-mop21-06-billion\/\" target=\"_blank\" rel=\"noreferrer noopener\">Macau Business<\/a>, JP Morgan analysts credited superstar Jacky Cheung – also known as “the God of song” – for the “unexpected seasonal surge”.<\/p>\n\n\n\n<p>The Citi team concurred. “We conducted our June 2025 table survey on the first night Cheung performed,” wrote Choi and Chau. “And we attribute all the positive findings from our survey to him” – including a 16% increase in premium players that night and a 36% increase in the the average wager.<\/p>\n\n\n\n<p>Vitaly Umansky of <a href=\"https:\/\/sso.bluematrix.com\/idp\/authn?conversation=e1s1&amp;OCT=M57S-OIS3-8QHK-MRW5\" target=\"_blank\" rel=\"noreferrer noopener\">Seaport Research Partners<\/a>, too, cited “strong entertainment events [and] high hold” for the upturn. <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2025-07-01\/macau-gaming-revenue-soars-past-estimate-on-concert-fervor\" target=\"_blank\" rel=\"noreferrer noopener\">Bloomberg<\/a> also tied the revenue boost to “concert fervour”.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-renewed-optimism-for-second-half\">Renewed optimism for second half<\/h2>\n\n\n\n<p>With more special events planned for July – Cheung’s “60-Plus” concert series continues at Galaxy Macau through Sunday – Seaport expects GGR to rise 10.2% year on year for the month. The investment firm has also upped its forecast for the second half, estimating 6.8% growth for the period and total annual GGR growth of 5.6%.<\/p>\n\n\n\n<p>“Growth should be driven by increased marketing efforts by operators and improving consumer trends in China,” Umansky wrote. “China stimulus and policy measures are likely to help shore up China&#8217;s economy and improve consumer confidence later this year.”<\/p>\n"
  },
  {
    "title":"Regulator&#8217;s report highlights German gambling&#8217;s ‘structural problem’, warns DSWV",
    "date":"2025-07-01T10:21:53",
    "link":"https:\/\/igamingbusiness.com\/sports-betting\/sports-betting-regulation\/regulator-report-germany-gambling-structural-problem-dswv\/",
    "content":"\n<p>The leading sports betting industry association in Germany has warned of a “serious structural problem” in the regulated gambling sector following the release of new market data.<\/p>\n\n\n\n<p>The German Sports Betting Association (DSWV) renewed its call for urgent reforms to the country’s gambling laws after the Joint Gambling Authority of the Federal States (GGL) <a href=\"https:\/\/igamingbusiness.com\/legal-compliance\/licensing\/german-gambling-regulator-claims-progress-illegal-market-battle\/\" target=\"_blank\" rel=\"noreferrer noopener\">published comprehensive industry figures for 2024<\/a>. The data revealed that around 25% of all gambling in Germany still takes place via unlicensed operators – a figure DSWV claims could significantly underestimate the real scale of the black market.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-medium\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/0QJ0NbhHxj196jtB-_3yl5TjUPtuDxDs8LfwueXrU-M\/resizing_type:auto\/width:0\/height:300\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9BbGxlXzAyX01ELmpwZw.webp\" alt=\"Mathias Dahms\" class=\"wp-image-384660\"\/><figcaption class=\"wp-element-caption\">Mathias Dahms<\/figcaption><\/figure><\/div>\n\n\n<p>DSWV expressed particular concern over the revelation there are currently 11 unlicensed gambling operators for every licensed betting platform in the country.<\/p>\n\n\n\n<p>“This development is a warning signal,” said DSWV President Mathias Dahms. “Illegal providers benefit from the fact that they can offer a much wider range of bets – especially in the area of particularly popular live betting and the number of sports and competitions that can be bet on.<\/p>\n\n\n\n<p>“This is precisely why many users switch to these illegal sites.”<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-dswv-questions-black-market-figures\">DSWV questions black market figures<\/h2>\n\n\n\n<p>According to GGL’s 2024 statistics, the number of illegal German-language sports betting websites monitored by the regulator increased from 281 in 2023 to 382 – a 36% rise. In comparison, only 34 websites from 30 operators held licences and appeared on the official white list published by the GGL.<\/p>\n\n\n\n<p>While the regulator has, for the first time, offered a concrete estimate of the unauthorised gambling market share, DSWV remains sceptical. The group pointed to several independent studies – including the <a href=\"https:\/\/igamingbusiness.com\/sports-betting\/gambling-germany-half-of-all-players-still-using-unregulated-sites\/\" target=\"_blank\" rel=\"noreferrer noopener\">Schnabl report<\/a>, commissioned by DSWV and DOCV – which suggest the black market may exceed 50% of all gambling activity in Germany.<\/p>\n\n\n\n<p>DSWV argued that these figures highlight fundamental flaws in the current regulatory framework, which was introduced via the 2021 Interstate Treaty on Gambling. <\/p>\n\n\n\n<p>“At least a quarter of the market is illegal – this is clear, official confirmation that the black market has long been a serious structural problem and not a marginal phenomenon,” said Dahms.<\/p>\n\n\n\n<p>“Anyone who wants to strengthen player protection must ensure that legal providers become competitive. Otherwise, it is precisely this protection that will be undermined by illegal offers.”<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-dswv-calls-for-gambling-regulation-reform-in-germany\">DSWV calls for gambling regulation reform in Germany<\/h2>\n\n\n\n<p>DSWV claims the GGL’s new figures underscore the need for a regulatory overhaul to make the licensed gambling market in Germany more attractive to consumers. The association said licensed betting operators face excessive restrictions and should be allowed to offer a broader range of products.<\/p>\n\n\n\n<p>In contrast to the black market, licensed operators in Germany are subject to strict compliance requirements, including mandatory identity verification, bet limits and access to the national cross-operator player blocking system.<\/p>\n\n\n\n<p>In Germany there is a €1 maximum stake limit on online slots in place, as well as industry-wide deposit limits, as enforced by the Interstate Treaty.&nbsp;Players are also capped at a €1,000 monthly deposit across all regulated platforms. <\/p>\n\n\n\n<p>Back in December 2023, an interim evaluation of the Interstate Treaty was launched to assess the effectiveness of current gambling regulations in Germany and make recommendations for improvements. Some&nbsp;of these suggestions are likely to be adopted by the federal states when they&nbsp;<a href=\"https:\/\/igamingbusiness.com\/legal-compliance\/regulation\/online-gambling-germany-2025\/\" target=\"_blank\" rel=\"noreferrer noopener\">amend the law this year<\/a>.<\/p>\n\n\n\n<p>“The legal market is safer today than ever before, with extensive measures to protect players,” said Dahms.<\/p>\n\n\n\n<p>“But if this market becomes less attractive due to overregulation, users will switch to illegal offers. Only those who create a reputable but also attractive offering can keep players in the legal market and effectively curb the black market.<\/p>\n\n\n\n<p>“The best protection against the black market is an attractive, legal offering. This includes more permitted types of betting, more live betting and realistic regulation.”<\/p>\n"
  },
  {
    "title":"Legacy lotteries are at risk of cannibalisation from prize draws",
    "date":"2025-07-01T10:18:55",
    "link":"https:\/\/igamingbusiness.com\/lottery\/lottery-prize-draws-uk-cannibalisation-innovation\/",
    "content":"\n<p>Today it is nigh on impossible to scroll through social media apps without being hit by a targeted ad for a “chance to win a million-pound house” in the UK. The likes of Omaze and Raffle House have taken the lottery sector by storm, after the prize draw vertical seemingly appeared out of nowhere a couple of years ago.  <\/p>\n\n\n\n<p>But in a Q3 gambling activity update from the Gambling Commission, player data suggested these prize draw offerings could be cannibalising traditional lotteries in the UK. “We’ve seen the growth of large-scale prize draws and that growth has been very significant,” <a href=\"https:\/\/igamingbusiness.com\/lottery\/free-prize-draws-cannibalization-gsgb-uk-gambling-participation-q3\/\" target=\"_blank\" rel=\"noreferrer noopener\">Gambling Commission CEO Andrew Rhodes told attendees of the Betting and Gaming Council’s AGM<\/a> on 27 February. &nbsp;<\/p>\n\n\n\n<p>He noted that prize draw products are experiencing a participation level that is much higher than that of other gambling products, or products regulated as gambling. “It’s getting close to being on a par with betting in terms of participation, also in terms of the average spending,” Rhodes said.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-should-prize-draws-be-regulated-alongside-lottery-nbsp\"><strong>Should prize draws be regulated alongside lottery?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The UK Lotteries Council, a body that represents the sector, has called for a re-evaluation of the currently largely unregulated prize draw vertical. It should fall under traditional lottery regulations, it says. “If there is a shift from society lotteries to unregulated prize draws, returns to good causes will inevitably decline. &nbsp;<\/p>\n\n\n\n<p>Million-pound prize draws represent the thin end of the wedge in lottery-based civil society fundraising,” Lotteries Council chair Tony Vick wrote in a March report on prize draws and charity lotteries. But James Miéville, executive director at Raffle House, a prize draw operator in the UK, says he does not believe the product is in competition with the National Lottery, as it is instead an entirely new demographic of players.  <\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/a8n7k_fnuoypyWYn6zOOpysip0LgX9p0D_GpSPpRfD8\/resizing_type:auto\/width:0\/height:1024\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9KYW1lcy1NaWV2aWxsZS1oZWFkc2hvdC1sb3R0ZXJ5LWZlYXR1cmUuanBn.webp\" alt=\"\" class=\"wp-image-384685\" style=\"width:303px;height:auto\"\/><figcaption class=\"wp-element-caption\">James Miéville of prize draw operator Raffle House says the vertical is not in competition with the UK national lottery<\/figcaption><\/figure><\/div>\n\n\n<p>“We believe companies such as ours have tapped into a previously unmet demand and that this has attracted new players rather than pulling players away from other products,” says Miéville. “Our player data suggests the audience for house prize draws is more diverse than that of lotteries.”  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-free-to-enter\">&#8216;Free to enter&#8217;<\/h2>\n\n\n\n<p>Today, prize draws offer a “free to enter” option, whereby players can send in an entry to a draw, only paying to send the entry. This means the vertical is exempt from falling under lottery rules as per the Lotteries Act. Also writing in the Lotteries Council report, Member of Parliament for Aldridge-Brownhills Wendy Morton warned these new games had become “indistinguishable” from charity lotteries, which are required to meet strict standards, like not offering large prizes or jackpots and paying back a certain percentage of earnings to charity.<\/p>\n\n\n\n<p>The case against prize draws, which are typically offering multimillion-pound prizes to players, is clear: they should be properly regulated, so the traditional lottery sector claims. <\/p>\n\n\n\n<p>In <a href=\"https:\/\/igamingbusiness.com\/legal-compliance\/compliance\/uk-government-voluntary-code-prize-draws-and-competitions\/\" target=\"_blank\" rel=\"noreferrer noopener\">a speech to parliament last week, Gambling Minister Baroness Twycross<\/a> said the vertical would not be placed under the Lottery Act regulations but rather a voluntary code which will seek to unify the vertical’s approach across the sector. <\/p>\n\n\n\n<p>Richard Williams, partner at Keystone Law, told&nbsp;iGB&nbsp;he expects a monitoring period of at least a year for prize draws, to assess whether any measures are successful. He said the code was largely an attempt to avoid introducing legislation.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-healthy-competition-nbsp\"><strong>Healthy competition<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Others in the lottery sector support the innovation behind the new vertical; after all, it is clearly appealing to a new demographic that more traditional lotteries have ignored for decades. Could this feud be exactly what lotteries need to reinvigorate the industry?&nbsp;<\/p>\n\n\n\n<p>“I get the impression that some players in the industry are trying to fight the competition through politics here, and I would say that’s not wise,” Helmut Becker, longstanding CEO for German lottery provider Zeal Network, tells iGB. <\/p>\n\n\n\n<p>“They should focus on innovation in their own business. I do think generally speaking there’s an opportunity for more innovation in our industry.” Becker laments the slow uptake of online lottery offerings. “The internet penetration in the lottery industry is relatively low, particularly in Germany where we are at 25%,” he says. &nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"2560\" src=\"https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-scaled.jpg\" alt=\"Zeal CEO Helmut Becker\" class=\"wp-image-378925\" style=\"width:387px;height:auto\" srcset=\"https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-scaled.jpg 2560w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-300x300.jpg 300w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1024x1024.jpg 1024w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-150x150.jpg 150w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-768x768.jpg 768w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1536x1536.jpg 1536w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-2048x2048.jpg 2048w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-650x650.jpg 650w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1300x1300.jpg 1300w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" \/><figcaption class=\"wp-element-caption\">Zeal CEO Helmut Becker urges lotteries not to stifle innovation from new verticals<\/figcaption><\/figure><\/div>\n\n\n<p>He goes on to compare the sector to other entertainment offerings like concerts, or even transportation services that offer tickets online for trains and buses. “Those industries have much higher rates of digital penetration. I see tremendous growth potential in the lottery industry converting from offline to online. There’s this continuous optimisation in ecommerce best practice [that we could&nbsp;learn from].” &nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-we-ve-seen-this-response-nbsp-before-nbsp\"><strong>We’ve seen this response&nbsp;before<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Zeal rode the wave of lottery betting (or&nbsp;lottery brokerage) solutions as the novel opportunity arose in 1999. <\/p>\n\n\n\n<p>Operators like Zeal and Lottoland offered players a chance to participate in mammoth jackpots, by betting on lottery draws around the world instead&nbsp;of just their national or state-run&nbsp;offering. In the beginning of this wave, operators were heavily scrutinised and many called for new regulations to clamp down on the spread of these types of offerings, similar to the fight against prize draws today. &nbsp;<\/p>\n\n\n\n<p>But Becker argues there is a need among younger and female demographics for new and novel solutions within lotteries. “There are new target groups, other target groups than the traditional lottery player, younger target groups, female target groups. And there are ways to address the needs of those target groups and that’s through product innovation. Creating new types of lotteries or new types of games like Dream House raffle, for example, unlocks another layer of growth [for operators],” he says. <\/p>\n\n\n\n<p>Zeal has both invested in and developed an in-house version of a prize draw offering but offered under a charity lottery licence, and Becker suggests it is this agility and commitment to innovation that has powered Zeal’s progressive growth in recent years.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/igamingbusiness.com\/finance\/full-year-results\/net-profit-record-2024-zeal\/\" target=\"_blank\" rel=\"noreferrer noopener\">In its full-year 2024 results, Zeal posted a record group revenue<\/a> of €188.2 million ($203 million), beating the previous year by 62.2%. It also saw bottom-line net profit rise 333.2% to €59.4 million. On this trajectory, Becker says the company has continuously optimised and grown its core business while making constant improvements in ecommerce, ensuring excellence in unit economics, efficiently allocating marketing spend and ultimately improving the customer lifetime value of its loyal customer base. There is clearly still demand for more traditional lottery betting offerings.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-can-it-cross-sell-nbsp\"><strong>Can it cross-sell?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>In the US, lottery courier services have exploded in the market. These offerings enable players to participate in draws operating in multiple states by buying tickets for different draws and enabling&nbsp;players to purchase them via the product. In February, <a href=\"https:\/\/igamingbusiness.com\/strategy\/draftkings-2025-guidance-lottery-inplay-betting\/\" target=\"_blank\" rel=\"noreferrer noopener\">DraftKings CEO Jason Robins talked up its 2024 acquisition of lottery betting app Jackpocket<\/a>, insisting the product was already proving a valuable customer acquisition and cross-sell tool.&nbsp;<\/p>\n\n\n\n<p>&nbsp;“Jackpocket has been great in terms of both cross-sell and, also, we have had really strong customer acquisition during its last $1 billion jackpot run. I do think that there’s room to invest more there,” Robins told analysts in its Q1 earnings call. &nbsp;<\/p>\n\n\n\n<p>“For us, it’s probably more effective in states where there’s legal sports betting and iGaming because the LTVs (lifetime value) in the immediate term are going to be higher because we can cross-sell right away.”&nbsp;<\/p>\n\n\n\n<p>He compared the product to DFS in terms of player acquisition opportunity, and of course it was DFS that helped skyrocket the likes of DraftKings and FanDuel to the top positions for both betting and iGaming in the States. But Becker says he is less certain of lottery’s cross-sell capabilities. &nbsp;<\/p>\n\n\n\n<p>“The jury is out on how big the synergies between different forms of gambling are, and whether it is possible to capture them and how,” he comments. “I haven’t seen the data yet, so for me the case is not closed on the cross-sell opportunity between lottery players and other forms of gambling being as big as expected.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-lottery-and-igaming\">Lottery and iGaming<\/h2>\n\n\n\n<p>Nikolina Gabelica, head of lottery operations at EveryMatrix, supports Robins’ assertion that lottery games can be successful acquisition tools. “I worked for an operator previously, and it had a clear path to use lottery as an acquisition tool. It’s easier to acquire a player, but not to say it’s cheaper, with lottery games. And that’s including instant games and scratchcards. Yes, this is easier, less frequent and less aggressive play. But it was used for acquisition of the players,” she says. <\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/Lk_uhJJVUXo6u4m650ss14PN7eUfcHe2h9uFymRLFxk\/resizing_type:auto\/width:1024\/height:0\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9OaWtvbGluYS1HYWJlbGljYV9FdmVyeU1hdHJpeC5wbmc.webp\" alt=\"\" class=\"wp-image-384682\" style=\"width:506px;height:auto\"\/><figcaption class=\"wp-element-caption\">EveryMatrix&#8217;s Nikolina Gabelica believes lottery can be a good product to cross-sell to iGaming<\/figcaption><\/figure><\/div>\n\n\n<p>“Of course, not all lottery players would transition to sports betting or iGaming. But yes, that journey was a natural one [for players].” However she acknowledges that gamified lottery products offering unique bonuses or a novel element prompt longer gaming sessions and a higher chance for cross-sell capabilities.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-lottery-across-the-pond-nbsp\"><strong>Lottery across the pond<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The US is operating a dynamic and nuanced lottery sector, but like other verticals it is fragmented and many states still have a state-run lottery monopoly in place. Therefore, regulations are hugely outdated and largely do not support new multistate courier operations like Jackpocket. The vertical came under fire in February when a group of investors won two multimillion-dollar jackpots in Texas, after mass purchasing of tickets in bulk, which effectively hacked the system. <\/p>\n\n\n\n<p>The scandal resulted in harsh criticism around the lottery courier offering, and Texas moved to ban these services in the state. <a href=\"https:\/\/oppaga.fl.gov\/Products\/ReportList\" target=\"_blank\" rel=\"noreferrer noopener\">According to 2024 data from the Office of Program Policy Analysis and Government Accountability<\/a>, lottery betting was available in 19 US states last year.&nbsp;<\/p>\n\n\n\n<p>“I think the US lotteries are concerned about it because they are finding themselves competing directly with very mighty private companies that are active in sports betting and iGaming,” Becker explains. “But I honestly don’t know how the US market will play out. I think it will be two steps forward, one step back. I think it will be very heterogeneous and be different in each state. &nbsp;<\/p>\n\n\n\n<p>“Oftentimes there’s no clear regulation for online sales. The courier model evolved because there is demand and somebody is just filling the gap. I think the problem is that there’s no good regulation in place to foster the well-regulated sales of online lottery tickets to customers.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-robust-regulation-is-crucial\">Robust regulation is crucial <\/h2>\n\n\n\n<p>Becker believes that, in order to maintain a thriving and innovative lottery sector, robust regulation is needed. And this is something that appears to be missing in the US. Germany, however, has robust lottery laws in place, he says. And having these laws in place has supported and encouraged the rise of new products and fresh innovations. &nbsp;<\/p>\n\n\n\n<p>He says the gambling regulator in Germany, the GGL, has determined clear boundaries for the lottery sector and this makes it easy for lottery brokerage operators like Zeal to adhere to the rules. “A well-regulated market fosters and incentivises good behaviour and growth. In the end, society benefits from that growth. I do think there’s an opportunity to strike a balance between a well-regulated and open market that is open to private players like us.”&nbsp;<\/p>\n\n\n\n<p>Many European markets also still operate lottery monopolies while others, like the UK and Italy, issue a tender for their national lottery. This is either won by a single lottery provider or a consortium of providers.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-all-change-for-lottery-in-the-uk-nbsp\"><strong>All change for lottery in the UK<\/strong>&nbsp;<\/h2>\n\n\n\n<p>In February 2024, global lottery provider Allwyn won the UK’s National Lottery tender, after almost 20 years of Camelot operating the programme. In securing the fourth licence, Allwyn saw off competition from a number of heavy hitters, including Camelot. However, the operator, which counts a number of European lottery companies under its belt, has faced criticism for failing to deliver on promises made during its successful bid for the lottery. &nbsp;<\/p>\n\n\n\n<p>Areas of concern to the Gambling Commission are said to include delays to digital upgrades. Allwyn is also said to have pledged to reduce ticket prices for the main National Lottery draw from £2 to £1, but this is yet to take place. In a statement issued to iGB, Allwyn said it is still committed to upgrading and modernising the system, with a planned spend of more than £350 million ($467 million) on improvements.  <\/p>\n\n\n\n<p>“Our investment will help restore the magic to The National Lottery,” Allwyn said. “But the shift from outdated systems is complex and requires robust testing. We will deliver essential upgrades over the coming year. We are working at pace to complete this transformation as soon as possible.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-can-lottery-keep-up-with-prize-draw-innovation\"><strong>Can lottery keep up with prize draw innovation?<\/strong><\/h2>\n\n\n\n<p>Allwyn shows it is harder to innovate in a legacy sector than some might believe. The outlook for lottery is positive. Becker believes there is much more to be achieved in the space, particularly in increasing the rate of digitisation. The demand for new lottery-style games will continue to grow as Gens Z and Alpha turn the appropriate age for playing these games. But national lotteries are certainly at risk of falling behind.&nbsp;<\/p>\n\n\n\n<p>“They’re setting a new standard for how play should feel,” Gabelica says of the “quick, easy experiences” of sweepstakes, crypto games and prize draws. “This is very difficult for lotteries to catch up [to]. And the risk is that if [these new games] change what players expect, and if the national lotteries don’t keep up, they will feel outdated, even if the prizes are much bigger,” she concludes.<\/p>\n"
  },
  {
    "title":"CDC Gaming Roundtable: In five years, the gaming industry landscape will be different",
    "date":"2025-07-01T19:00:35",
    "link":"https:\/\/cdcgaming.com\/cdc-gaming-roundtable-in-five-years-the-gaming-industry-landscape-will-be-different\/",
    "content":"<p>In 2020, the gaming industry landscape looked remarkably different.<\/p>\n<p>Legal sports betting was only two years old and operators spent enormous sums of money vying for customers. Cashless payments were a trendy new development that seemed on the verge of widespread adoption. And almost no one had heard of sweepstakes or prediction markets.<\/p>\n<p>Flash forward to 2025: The number of sports betting operators has been winnowed, with clear winners, including DraftKings and FanDuel, now the market leaders. The adoption of cashless payment systems has progressed steadily but is still not widespread. And sweepstakes and prediction markets are currently hot-button issues in the industry that were largely unknown in 2020.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-4198391461\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/109793\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"Excel Dryer web 250721\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721.jpg\" alt=\"\"  srcset=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721.jpg 720w, https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721-375x86.jpg 375w\" sizes=\"(max-width: 720px) 100vw, 720px\" class=\"no-lazyload\" width=\"720\" height=\"166\"   \/><\/a><\/div>\n<p>In five years, the gaming industry will likely reflect similar change, some not yet apparent.<\/p>\n<p>CDC Gaming recently hosted a roundtable on what the gaming industry will look like in 2030. Three industry insiders took part: Dr. Laila Mintas, an entrepreneur and strategic advisor; Daniel Wallach, U.S. gaming law and sports betting attorney; and Anne Hay, PayNearMe Executive Vice President and CMO.<\/p>\n<p>Mintas said it’s instructive to look back at where the gaming industry stood in 2020 before looking ahead. She recalled that operators were in the midst of a “gold rush” regarding the then two-year-old repeal of the Professional and Amateur Sports Protection Act (PASPA), and that “no one really cared about user acquisition costs. People were spending like there’s no tomorrow.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1015409081\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/72800\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"trustlybanner\"  role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Trustly-web-250701.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('trustlybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Trustly-web-250701.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>In five years, Mintas says, expect chaos to continue.<\/p>\n<p>“As of today, we have seven states in the U.S. that have online casino and I think this regulatory environment left a big gap in the market,” Mintas said. “That enabled the operators that you see that are now coming in and disrupting, if you can speak even from disruption, because the market is still so young. But you see crypto.com coming in. You see all the sweepstakes coming in. You see the prediction markets, like the Kalshi’s of the world.<\/p>\n<p>“There&#8217;s so much going on right now in the market. I think in five years from now, or in the next five years, we will see a lot of legal cases and fights and about who gets what share of that big pie. And it will probably get pretty, pretty heated. And I think there will be new operators and new businesses coming in, trying to ban existing regulations, using loopholes, trying to regulate in a different way.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-904095686\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/107546\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"Print\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/06\/Plastic-Graphics-email-web-250626.jpg\" alt=\"\"  srcset=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/06\/Plastic-Graphics-email-web-250626.jpg 720w, https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/06\/Plastic-Graphics-email-web-250626-375x94.jpg 375w\" sizes=\"(max-width: 720px) 100vw, 720px\" class=\"no-lazyload\" width=\"720\" height=\"180\"   \/><\/a><\/div>\n<p>Wallach said the repeal of PASPA paved the way for unanticipated actions that are now reverberating. He said that Native American tribes are now using the Indian Gaming Regulatory Act to advance online gaming; that daily fantasy contests have expanded to include player proposition bets; that sweepstakes have emerged, and the Commodity Futures Trading Commission (CFTC) is now the regulator for the sports prediction market.<\/p>\n<p>The repeal of PASPA not only created a regulated marketplace but also incentivized some individuals and companies to look for shortcuts.<\/p>\n<p>“We’re now redefining what a bet is, what a wager is, what is an entry fee, what&#8217;s a contest, what&#8217;s a game of skill, what&#8217;s a game of chance, what&#8217;s a commodity,” Wallach said. “It&#8217;s all part of a common thread of the significant financial upside associated with gaming, creating ingenuity.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1274579495\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14518\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"galaxybanner\"  role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Galaxy-Gaming-web-250718.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('galaxybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Galaxy-Gaming-web-250718.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>“They call it innovation, but in many ways, it&#8217;s a workaround or a loophole that&#8217;s being exploited based on either actual or perceived gaps in the law. And I don&#8217;t know that this represents a safe opportunity for investment. I think there&#8217;s a lot of volatility in play here because each of these expanded areas, saved for tribal digital gaming, has attracted significant scrutiny from states and from courts, and it is a very uncertain investment climate. The one thing I do know is that there will always be something else. There will be something else to come in that we didn&#8217;t see today.”<\/p>\n<p>Hay says the payments space is rife with legacy platforms that were “falling short” and that inefficiencies are abundant. PayNearMe has worked to rectify those shortcomings and foresees new payment types emerging in the near future.<\/p>\n<p>She notes that PayNearMe consistently receives inquiries about using cryptocurrencies as a form of payment. Hay said that the recent FiServ announcement that it is launching a stablecoin for banks opens up a new avenue that players may embrace, especially since there are a lot of fraud and risk controls associated with the development.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-933501722\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1784179393\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14549\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"QCI-web-220301-3.gif\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2022\/09\/QCI-web-220301-3.gif\" alt=\"\"  class=\"no-lazyload\" width=\"720\" height=\"90\"   \/><\/a><\/div><\/div>\n<p>“This payment has a potential to be faster and cheaper,” Hay said. “And it’s not even five years out &#8212; I think that&#8217;s going to be even sooner. And things like stablecoin also seem to have a tighter set of controls, because the banks are behind it. And so, I expect that will be favorable for regulators and things like that.”<\/p>\n<p>The increased use of artificial intelligence in gaming also seems to be inevitable, although Mintas admits, “our industry is not the most innovative industry.”<\/p>\n<p>‘But I think we will be like a target zone, because most of the gambling industry, at least that I&#8217;m dealing with, is online,” Mintas says. &#8220;So, it&#8217;s perfect. It&#8217;s perfect to be targeted for AI products.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-457595414\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/45076\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"koinbanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Koin-web-250228.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('koinbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Koin-web-250228.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script>\r\n\r\n<\/a><\/div>\n<p>Hay considers AI to be the prototypical buzzword. Every company in the gaming industry is either using AI or discussing how to use artificial intelligence, but no one has figured out how best to deploy it.<\/p>\n<p>She notes that PayNearMe is currently experimenting extensively with AI. Hay suggests that in the near future, companies should “lean into it” and hire experts instead of trying to grapple with AI on their own. There are indications, at least in the payments space, that AI will be beneficial.<\/p>\n<p>“We&#8217;re seeing some promising signs where it&#8217;s helping operate or sort of increase those acceptance rates,” Hay said, “and ultimately just provide a better experience for players and removing some of those barriers to completing deposits or withdrawals.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2680969488\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2401441985\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14497\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"smokefree-customers-preferences-720&#215;90-1.gif\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2022\/09\/smokefree-customers-preferences-720x90-1.gif\" alt=\"\"  class=\"no-lazyload\" width=\"720\" height=\"90\"   \/><\/a><\/div><\/div>\n<p>Sweepstakes and prediction markets, however, loom large on the horizon. While many states, including Michigan, Louisiana, New York, Mississippi, and California, have issued cease-and-desist orders to companies hosting sweepstakes games and prediction markets, Kalshi, notably, has resisted any impediments to doing business.<\/p>\n<p>Kalshi, regulated by the CFTC, currently can operate in all 50 states, claiming it doesn’t offer gambling.<\/p>\n<p>According to Wallach, Kalshi and other prediction market companies insist that because they are regulated by the CFTC, they are able to operate.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3371816520\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/97541\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"conjointlybanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Conjointly-web-250318.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('conjointlybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Conjointly-web-250318.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script>\r\n\r\n<\/a><\/div>\n<p>“I think under a traditional preemption analysis, I think the states do have the better argument,” Wallach says. “But I think the ultimate trump card here, no pun intended, belongs to the Trump administration, because even if the states win, which is maybe potentially in a year to two years of a dog fight in the federal courts, as long as Trump retains control over our Congress, the administration&#8217;s response to a loss in court could simply be to usher in statutory amendments to the Commodity Exchange Act, to make clear or to clarify that sweepstakes and commodities can include event contracts tied to real world.”<\/p>\n"
  },
  {
    "title":"Macau gaming up 19% for June on strength of entertainment",
    "date":"2025-07-01T16:28:24",
    "link":"https:\/\/igamingbusiness.com\/finance\/full-year-results\/macau-gaming-june-revenue-increase-strength-entertainment\/",
    "content":"\n<p>The Macau casino industry finished June on a high note. Gross gaming revenue for the month came to MOP21.06 billion ($2.6 billion), up 19% year on year. Added to a robust performance in May – a 5% boost in GGR versus the consensus of 2.7% – it brings total GGR so far to MOP118.77 billion, up 4.4% over 2024.<\/p>\n\n\n\n<p>It’s a welcome development for the Asian gaming mecca, which <a href=\"https:\/\/igamingbusiness.com\/casino\/analysts-macau-on-the-way-to-full-recovery-by-26\/\" target=\"_blank\" rel=\"noreferrer noopener\">started the year strongly<\/a> only to see the momentum dwindle.<\/p>\n\n\n\n<p>Last year, anticipating a bump in tourism, government officials set a <a href=\"https:\/\/igamingbusiness.com\/casino\/macau-tourism-to-stoke-ggr-in-new-year\/\" target=\"_blank\" rel=\"noreferrer noopener\">GGR target of MOP240 billion<\/a> for 2025. Industry analysts were even more upbeat. Citi’s George Choi and Timothy Chau projected a 7% increase in GGR year-over-year, for a total of MOP244 billion.<\/p>\n\n\n\n<p>But those hopes soon dimmed. Following lacklustre revenues in January and February, the government <a href=\"https:\/\/igamingbusiness.com\/casino\/tourism\/macau-chief-executive-projected-revenue-gaming-slump\/\" target=\"_blank\" rel=\"noreferrer noopener\">adjusted its expectations<\/a> downward, resetting the yearly total to MOP228 billion.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-june-boost-tied-to-god-of-song\">June boost tied to ‘God of song’<\/h2>\n\n\n\n<p>June’s results put Macau on track to meet and surpass the government’s revised forecast – and all because of a 60ish crooner called the “Heavenly King of Cantopop”.<\/p>\n\n\n\n<p>According to <a href=\"https:\/\/www.macaubusiness.com\/june-gaming-revenue-jumps-19-pct-to-mop21-06-billion\/\" target=\"_blank\" rel=\"noreferrer noopener\">Macau Business<\/a>, JP Morgan analysts credited superstar Jacky Cheung – also known as “the God of song” – for the “unexpected seasonal surge”.<\/p>\n\n\n\n<p>The Citi team concurred. “We conducted our June 2025 table survey on the first night Cheung performed,” wrote Choi and Chau. “And we attribute all the positive findings from our survey to him” – including a 16% increase in premium players that night and a 36% increase in the the average wager.<\/p>\n\n\n\n<p>Vitaly Umansky of <a href=\"https:\/\/sso.bluematrix.com\/idp\/authn?conversation=e1s1&amp;OCT=M57S-OIS3-8QHK-MRW5\" target=\"_blank\" rel=\"noreferrer noopener\">Seaport Research Partners<\/a>, too, cited “strong entertainment events [and] high hold” for the upturn. <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2025-07-01\/macau-gaming-revenue-soars-past-estimate-on-concert-fervor\" target=\"_blank\" rel=\"noreferrer noopener\">Bloomberg<\/a> also tied the revenue boost to “concert fervour”.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-renewed-optimism-for-second-half\">Renewed optimism for second half<\/h2>\n\n\n\n<p>With more special events planned for July – Cheung’s “60-Plus” concert series continues at Galaxy Macau through Sunday – Seaport expects GGR to rise 10.2% year on year for the month. The investment firm has also upped its forecast for the second half, estimating 6.8% growth for the period and total annual GGR growth of 5.6%.<\/p>\n\n\n\n<p>“Growth should be driven by increased marketing efforts by operators and improving consumer trends in China,” Umansky wrote. “China stimulus and policy measures are likely to help shore up China&#8217;s economy and improve consumer confidence later this year.”<\/p>\n"
  },
  {
    "title":"Legacy lotteries are at risk of cannibalisation from prize draws",
    "date":"2025-07-01T10:18:55",
    "link":"https:\/\/igamingbusiness.com\/lottery\/lottery-prize-draws-uk-cannibalisation-innovation\/",
    "content":"\n<p>Today it is nigh on impossible to scroll through social media apps without being hit by a targeted ad for a “chance to win a million-pound house” in the UK. The likes of Omaze and Raffle House have taken the lottery sector by storm, after the prize draw vertical seemingly appeared out of nowhere a couple of years ago.  <\/p>\n\n\n\n<p>But in a Q3 gambling activity update from the Gambling Commission, player data suggested these prize draw offerings could be cannibalising traditional lotteries in the UK. “We’ve seen the growth of large-scale prize draws and that growth has been very significant,” <a href=\"https:\/\/igamingbusiness.com\/lottery\/free-prize-draws-cannibalization-gsgb-uk-gambling-participation-q3\/\" target=\"_blank\" rel=\"noreferrer noopener\">Gambling Commission CEO Andrew Rhodes told attendees of the Betting and Gaming Council’s AGM<\/a> on 27 February. &nbsp;<\/p>\n\n\n\n<p>He noted that prize draw products are experiencing a participation level that is much higher than that of other gambling products, or products regulated as gambling. “It’s getting close to being on a par with betting in terms of participation, also in terms of the average spending,” Rhodes said.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-should-prize-draws-be-regulated-alongside-lottery-nbsp\"><strong>Should prize draws be regulated alongside lottery?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The UK Lotteries Council, a body that represents the sector, has called for a re-evaluation of the currently largely unregulated prize draw vertical. It should fall under traditional lottery regulations, it says. “If there is a shift from society lotteries to unregulated prize draws, returns to good causes will inevitably decline. &nbsp;<\/p>\n\n\n\n<p>Million-pound prize draws represent the thin end of the wedge in lottery-based civil society fundraising,” Lotteries Council chair Tony Vick wrote in a March report on prize draws and charity lotteries. But James Miéville, executive director at Raffle House, a prize draw operator in the UK, says he does not believe the product is in competition with the National Lottery, as it is instead an entirely new demographic of players.  <\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/a8n7k_fnuoypyWYn6zOOpysip0LgX9p0D_GpSPpRfD8\/resizing_type:auto\/width:0\/height:1024\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9KYW1lcy1NaWV2aWxsZS1oZWFkc2hvdC1sb3R0ZXJ5LWZlYXR1cmUuanBn.webp\" alt=\"\" class=\"wp-image-384685\" style=\"width:303px;height:auto\"\/><figcaption class=\"wp-element-caption\">James Miéville of prize draw operator Raffle House says the vertical is not in competition with the UK national lottery<\/figcaption><\/figure><\/div>\n\n\n<p>“We believe companies such as ours have tapped into a previously unmet demand and that this has attracted new players rather than pulling players away from other products,” says Miéville. “Our player data suggests the audience for house prize draws is more diverse than that of lotteries.”  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-free-to-enter\">&#8216;Free to enter&#8217;<\/h2>\n\n\n\n<p>Today, prize draws offer a “free to enter” option, whereby players can send in an entry to a draw, only paying to send the entry. This means the vertical is exempt from falling under lottery rules as per the Lotteries Act. Also writing in the Lotteries Council report, Member of Parliament for Aldridge-Brownhills Wendy Morton warned these new games had become “indistinguishable” from charity lotteries, which are required to meet strict standards, like not offering large prizes or jackpots and paying back a certain percentage of earnings to charity.<\/p>\n\n\n\n<p>The case against prize draws, which are typically offering multimillion-pound prizes to players, is clear: they should be properly regulated, so the traditional lottery sector claims. <\/p>\n\n\n\n<p>In <a href=\"https:\/\/igamingbusiness.com\/legal-compliance\/compliance\/uk-government-voluntary-code-prize-draws-and-competitions\/\" target=\"_blank\" rel=\"noreferrer noopener\">a speech to parliament last week, Gambling Minister Baroness Twycross<\/a> said the vertical would not be placed under the Lottery Act regulations but rather a voluntary code which will seek to unify the vertical’s approach across the sector. <\/p>\n\n\n\n<p>Richard Williams, partner at Keystone Law, told&nbsp;iGB&nbsp;he expects a monitoring period of at least a year for prize draws, to assess whether any measures are successful. He said the code was largely an attempt to avoid introducing legislation.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-healthy-competition-nbsp\"><strong>Healthy competition<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Others in the lottery sector support the innovation behind the new vertical; after all, it is clearly appealing to a new demographic that more traditional lotteries have ignored for decades. Could this feud be exactly what lotteries need to reinvigorate the industry?&nbsp;<\/p>\n\n\n\n<p>“I get the impression that some players in the industry are trying to fight the competition through politics here, and I would say that’s not wise,” Helmut Becker, longstanding CEO for German lottery provider Zeal Network, tells iGB. <\/p>\n\n\n\n<p>“They should focus on innovation in their own business. I do think generally speaking there’s an opportunity for more innovation in our industry.” Becker laments the slow uptake of online lottery offerings. “The internet penetration in the lottery industry is relatively low, particularly in Germany where we are at 25%,” he says. &nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"2560\" src=\"https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-scaled.jpg\" alt=\"Zeal CEO Helmut Becker\" class=\"wp-image-378925\" style=\"width:387px;height:auto\" srcset=\"https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-scaled.jpg 2560w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-300x300.jpg 300w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1024x1024.jpg 1024w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-150x150.jpg 150w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-768x768.jpg 768w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1536x1536.jpg 1536w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-2048x2048.jpg 2048w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-650x650.jpg 650w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1300x1300.jpg 1300w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" \/><figcaption class=\"wp-element-caption\">Zeal CEO Helmut Becker urges lotteries not to stifle innovation from new verticals<\/figcaption><\/figure><\/div>\n\n\n<p>He goes on to compare the sector to other entertainment offerings like concerts, or even transportation services that offer tickets online for trains and buses. “Those industries have much higher rates of digital penetration. I see tremendous growth potential in the lottery industry converting from offline to online. There’s this continuous optimisation in ecommerce best practice [that we could&nbsp;learn from].” &nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-we-ve-seen-this-response-nbsp-before-nbsp\"><strong>We’ve seen this response&nbsp;before<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Zeal rode the wave of lottery betting (or&nbsp;lottery brokerage) solutions as the novel opportunity arose in 1999. <\/p>\n\n\n\n<p>Operators like Zeal and Lottoland offered players a chance to participate in mammoth jackpots, by betting on lottery draws around the world instead&nbsp;of just their national or state-run&nbsp;offering. In the beginning of this wave, operators were heavily scrutinised and many called for new regulations to clamp down on the spread of these types of offerings, similar to the fight against prize draws today. &nbsp;<\/p>\n\n\n\n<p>But Becker argues there is a need among younger and female demographics for new and novel solutions within lotteries. “There are new target groups, other target groups than the traditional lottery player, younger target groups, female target groups. And there are ways to address the needs of those target groups and that’s through product innovation. Creating new types of lotteries or new types of games like Dream House raffle, for example, unlocks another layer of growth [for operators],” he says. <\/p>\n\n\n\n<p>Zeal has both invested in and developed an in-house version of a prize draw offering but offered under a charity lottery licence, and Becker suggests it is this agility and commitment to innovation that has powered Zeal’s progressive growth in recent years.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/igamingbusiness.com\/finance\/full-year-results\/net-profit-record-2024-zeal\/\" target=\"_blank\" rel=\"noreferrer noopener\">In its full-year 2024 results, Zeal posted a record group revenue<\/a> of €188.2 million ($203 million), beating the previous year by 62.2%. It also saw bottom-line net profit rise 333.2% to €59.4 million. On this trajectory, Becker says the company has continuously optimised and grown its core business while making constant improvements in ecommerce, ensuring excellence in unit economics, efficiently allocating marketing spend and ultimately improving the customer lifetime value of its loyal customer base. There is clearly still demand for more traditional lottery betting offerings.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-can-it-cross-sell-nbsp\"><strong>Can it cross-sell?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>In the US, lottery courier services have exploded in the market. These offerings enable players to participate in draws operating in multiple states by buying tickets for different draws and enabling&nbsp;players to purchase them via the product. In February, <a href=\"https:\/\/igamingbusiness.com\/strategy\/draftkings-2025-guidance-lottery-inplay-betting\/\" target=\"_blank\" rel=\"noreferrer noopener\">DraftKings CEO Jason Robins talked up its 2024 acquisition of lottery betting app Jackpocket<\/a>, insisting the product was already proving a valuable customer acquisition and cross-sell tool.&nbsp;<\/p>\n\n\n\n<p>&nbsp;“Jackpocket has been great in terms of both cross-sell and, also, we have had really strong customer acquisition during its last $1 billion jackpot run. I do think that there’s room to invest more there,” Robins told analysts in its Q1 earnings call. &nbsp;<\/p>\n\n\n\n<p>“For us, it’s probably more effective in states where there’s legal sports betting and iGaming because the LTVs (lifetime value) in the immediate term are going to be higher because we can cross-sell right away.”&nbsp;<\/p>\n\n\n\n<p>He compared the product to DFS in terms of player acquisition opportunity, and of course it was DFS that helped skyrocket the likes of DraftKings and FanDuel to the top positions for both betting and iGaming in the States. But Becker says he is less certain of lottery’s cross-sell capabilities. &nbsp;<\/p>\n\n\n\n<p>“The jury is out on how big the synergies between different forms of gambling are, and whether it is possible to capture them and how,” he comments. “I haven’t seen the data yet, so for me the case is not closed on the cross-sell opportunity between lottery players and other forms of gambling being as big as expected.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-lottery-and-igaming\">Lottery and iGaming<\/h2>\n\n\n\n<p>Nikolina Gabelica, head of lottery operations at EveryMatrix, supports Robins’ assertion that lottery games can be successful acquisition tools. “I worked for an operator previously, and it had a clear path to use lottery as an acquisition tool. It’s easier to acquire a player, but not to say it’s cheaper, with lottery games. And that’s including instant games and scratchcards. Yes, this is easier, less frequent and less aggressive play. But it was used for acquisition of the players,” she says. <\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/Lk_uhJJVUXo6u4m650ss14PN7eUfcHe2h9uFymRLFxk\/resizing_type:auto\/width:1024\/height:0\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9OaWtvbGluYS1HYWJlbGljYV9FdmVyeU1hdHJpeC5wbmc.webp\" alt=\"\" class=\"wp-image-384682\" style=\"width:506px;height:auto\"\/><figcaption class=\"wp-element-caption\">EveryMatrix&#8217;s Nikolina Gabelica believes lottery can be a good product to cross-sell to iGaming<\/figcaption><\/figure><\/div>\n\n\n<p>“Of course, not all lottery players would transition to sports betting or iGaming. But yes, that journey was a natural one [for players].” However she acknowledges that gamified lottery products offering unique bonuses or a novel element prompt longer gaming sessions and a higher chance for cross-sell capabilities.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-lottery-across-the-pond-nbsp\"><strong>Lottery across the pond<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The US is operating a dynamic and nuanced lottery sector, but like other verticals it is fragmented and many states still have a state-run lottery monopoly in place. Therefore, regulations are hugely outdated and largely do not support new multistate courier operations like Jackpocket. The vertical came under fire in February when a group of investors won two multimillion-dollar jackpots in Texas, after mass purchasing of tickets in bulk, which effectively hacked the system. <\/p>\n\n\n\n<p>The scandal resulted in harsh criticism around the lottery courier offering, and Texas moved to ban these services in the state. <a href=\"https:\/\/oppaga.fl.gov\/Products\/ReportList\" target=\"_blank\" rel=\"noreferrer noopener\">According to 2024 data from the Office of Program Policy Analysis and Government Accountability<\/a>, lottery betting was available in 19 US states last year.&nbsp;<\/p>\n\n\n\n<p>“I think the US lotteries are concerned about it because they are finding themselves competing directly with very mighty private companies that are active in sports betting and iGaming,” Becker explains. “But I honestly don’t know how the US market will play out. I think it will be two steps forward, one step back. I think it will be very heterogeneous and be different in each state. &nbsp;<\/p>\n\n\n\n<p>“Oftentimes there’s no clear regulation for online sales. The courier model evolved because there is demand and somebody is just filling the gap. I think the problem is that there’s no good regulation in place to foster the well-regulated sales of online lottery tickets to customers.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-robust-regulation-is-crucial\">Robust regulation is crucial <\/h2>\n\n\n\n<p>Becker believes that, in order to maintain a thriving and innovative lottery sector, robust regulation is needed. And this is something that appears to be missing in the US. Germany, however, has robust lottery laws in place, he says. And having these laws in place has supported and encouraged the rise of new products and fresh innovations. &nbsp;<\/p>\n\n\n\n<p>He says the gambling regulator in Germany, the GGL, has determined clear boundaries for the lottery sector and this makes it easy for lottery brokerage operators like Zeal to adhere to the rules. “A well-regulated market fosters and incentivises good behaviour and growth. In the end, society benefits from that growth. I do think there’s an opportunity to strike a balance between a well-regulated and open market that is open to private players like us.”&nbsp;<\/p>\n\n\n\n<p>Many European markets also still operate lottery monopolies while others, like the UK and Italy, issue a tender for their national lottery. This is either won by a single lottery provider or a consortium of providers.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-all-change-for-lottery-in-the-uk-nbsp\"><strong>All change for lottery in the UK<\/strong>&nbsp;<\/h2>\n\n\n\n<p>In February 2024, global lottery provider Allwyn won the UK’s National Lottery tender, after almost 20 years of Camelot operating the programme. In securing the fourth licence, Allwyn saw off competition from a number of heavy hitters, including Camelot. However, the operator, which counts a number of European lottery companies under its belt, has faced criticism for failing to deliver on promises made during its successful bid for the lottery. &nbsp;<\/p>\n\n\n\n<p>Areas of concern to the Gambling Commission are said to include delays to digital upgrades. Allwyn is also said to have pledged to reduce ticket prices for the main National Lottery draw from £2 to £1, but this is yet to take place. In a statement issued to iGB, Allwyn said it is still committed to upgrading and modernising the system, with a planned spend of more than £350 million ($467 million) on improvements.  <\/p>\n\n\n\n<p>“Our investment will help restore the magic to The National Lottery,” Allwyn said. “But the shift from outdated systems is complex and requires robust testing. We will deliver essential upgrades over the coming year. We are working at pace to complete this transformation as soon as possible.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-can-lottery-keep-up-with-prize-draw-innovation\"><strong>Can lottery keep up with prize draw innovation?<\/strong><\/h2>\n\n\n\n<p>Allwyn shows it is harder to innovate in a legacy sector than some might believe. The outlook for lottery is positive. Becker believes there is much more to be achieved in the space, particularly in increasing the rate of digitisation. The demand for new lottery-style games will continue to grow as Gens Z and Alpha turn the appropriate age for playing these games. But national lotteries are certainly at risk of falling behind.&nbsp;<\/p>\n\n\n\n<p>“They’re setting a new standard for how play should feel,” Gabelica says of the “quick, easy experiences” of sweepstakes, crypto games and prize draws. “This is very difficult for lotteries to catch up [to]. And the risk is that if [these new games] change what players expect, and if the national lotteries don’t keep up, they will feel outdated, even if the prizes are much bigger,” she concludes.<\/p>\n"
  },
  {
    "title":"Here&#8217;s a recap of this session&#8217;s Nevada legislation impacting the gaming industry",
    "date":"2025-07-01T19:09:07",
    "link":"https:\/\/cdcgaming.com\/recap-of-nevada-legislation-impacting-gaming-industry\/",
    "content":"<p>The Nevada Legislature wrapped up its session in June. Some bills impacting the gaming industry went into effect Tuesday; others will go into force at a later date.<\/p>\n<p>Senate Bill 459 came out of a Nevada Gaming Control Board workshop held in December, with the backing of the Nevada Resort Association. The goal was to make it easier for the public to access high-end gaming salons. There’s no longer a $500-minimum wager to play slots. Instead, casinos can set minimum wagers approved by the Gaming Control Board. The salons are no longer required to include table games.<\/p>\n<p>Gaming-salon regulations have been in effect for 24 years and the intent is to make them more accessible to the public when not in private use as a way to attract more visitors and generate more revenue. That bill is in effect.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-877801649\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/97541\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"conjointlybanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Conjointly-web-250318.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('conjointlybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Conjointly-web-250318.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script>\r\n\r\n<\/a><\/div>\n<p>“We want to make salons more appealing for guests and operators,” said Virginia Valentine, CEO of the Nevada Resort Association. “One of the things that came out of that workshop was that a $500 minimum was pretty high, and that there wasn’t the same appetite for table games as slot machines. We feel like it’s going to expand the opportunities in salons and attract players who may be playing in private card rooms (and tribal casinos) in California. We think it will attract some new visitors and also enhance the experience for visitors who may want more security or more privacy.”<\/p>\n<p>Currently, the financial criterion for admission to a gaming salon includes an up-front deposit of at least $300,000, a $300,000 line of credit, or a combination of the two totaling at least $300,000. The industry would like to see that price of entry reduced or eliminated.<\/p>\n<p>Those limits are at the discretion of the Gaming Control Board and Gaming Commission, Valentine said. She expects a workshop to be held in the near future on the issue.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-4086846702\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1904921837\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14497\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"smokefree-customers-preferences-720&#215;90-1.gif\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2022\/09\/smokefree-customers-preferences-720x90-1.gif\" alt=\"\"  class=\"no-lazyload\" width=\"720\" height=\"90\"   \/><\/a><\/div><\/div>\n<p>“Right now, it&#8217;s a pretty narrow audience for salons,” Valentine said. “You want to maintain that surveillance and security, but you also want to offer these salon experiences to high-value players and not necessarily people who are going to lose a half-million dollars.”<\/p>\n<p>Senate Bill 256, which goes into effect Oct. 1, requires the disgorgement of profits from illegal gaming activities and increases penalties. The legislation was in response to prediction markets, sweepstakes operators, and other online companies functioning in the state without a gaming license. The money will go into the state’s general fund as part of court action.<\/p>\n<p>Nevada has sent cease-and-desist letters to sweepstakes and prediction-market operators. State gaming regulators have been locked in a legal battle with financial exchange Kalshi, which offers contracts on sports and receives a fee. Nevada’s Kalshi cease-and-desist order has been halted by a federal judge.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3376762362\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-391803293\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/105836\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"719\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"mindwaybanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Mindway-web-250708.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('mindwaybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Mindway-web-250708.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 719;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div><\/div>\n<p>“The bill was really targeted toward sweepstakes,” Valentine said. “A number of states across the country are outlawing sweepstakes, which are illegal gaming and unregulated. What the disgorgement does is add an extra disincentive to operating illegally here. If they have to forfeit all the profits to the state, that’s a bigger disincentive than fines. You see this around the country.”<\/p>\n<p>Assembly Bill 58, which went into effect Tuesday, allows approval by the chair of the Gaming Control Board for games and gaming devices, streamlining the process. It enables new gaming devices to be on the floor as fast as 50 to 60 days in some circumstances. That includes traditional table games and gaming devices. Previously, the process required Commission approval.<\/p>\n<p>Despite the change, the games still go through the same rigorous testing process, according to Sebastian Ross, a senior policy counsel for the Board.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-1432586683\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/109793\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"Excel Dryer web 250721\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721.jpg\" alt=\"\"  srcset=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721.jpg 720w, https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Excel-Dryer-web-250721-375x86.jpg 375w\" sizes=\"(max-width: 720px) 100vw, 720px\" class=\"no-lazyload\" width=\"720\" height=\"166\"   \/><\/a><\/div>\n<p>Also effective Tuesday, Senate Bill 46 provides parameters for the Gaming Control Board to maintain jurisdiction and investigate and initiate hearings to impose discipline for those who were licensed and found suitable by the Board and Commission. The Board will be submitting regulations for the Commission to adopt, Ross said.<\/p>\n<p>The new law allows fines of not more than $500,000 for each separate violation that is the subject of an initial complaint, and $1 million for each separate violation that is the subject of a subsequent complaint. Existing law established fines of not more than $100,000 for certain violations and not more than $250,000 for each separate violation.<\/p>\n<p>“They raised the statutory-fine range for violations of the Nevada Gaming Control Act,” Ross said. “When it comes to the increase of the fine ranges, it’s going to be up to the Nevada Gaming Commission to determine what the amount is. One of the things we&#8217;ve seen in recent months is agreements that go above the fine threshold. The licensee will still have the ability to negotiate with the Board those settlements, but ultimately it will be for the Commission to approve.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3966939430\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/42414\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"lockdogsbanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Lockdogs-web-150718.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('lockdogsbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Lockdogs-web-150718.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>Senate Bill 203 provides legal immunity to the Nevada Gaming Commission and related entities for good-faith actions and clarifies that off-track pari-mutuel systems and operators don&#8217;t need to be physically present in Nevada under certain conditions.<\/p>\n<p>“It eliminates the need for a track to enter into an agreement with a disseminator,” Ross said. “The track can go directly with a book now.”<\/p>\n"
  },
  {
    "title":"Legacy lotteries are at risk of cannibalisation from prize draws",
    "date":"2025-07-01T10:18:55",
    "link":"https:\/\/igamingbusiness.com\/lottery\/lottery-prize-draws-uk-cannibalisation-innovation\/",
    "content":"\n<p>Today it is nigh on impossible to scroll through social media apps without being hit by a targeted ad for a “chance to win a million-pound house” in the UK. The likes of Omaze and Raffle House have taken the lottery sector by storm, after the prize draw vertical seemingly appeared out of nowhere a couple of years ago.  <\/p>\n\n\n\n<p>But in a Q3 gambling activity update from the Gambling Commission, player data suggested these prize draw offerings could be cannibalising traditional lotteries in the UK. “We’ve seen the growth of large-scale prize draws and that growth has been very significant,” <a href=\"https:\/\/igamingbusiness.com\/lottery\/free-prize-draws-cannibalization-gsgb-uk-gambling-participation-q3\/\" target=\"_blank\" rel=\"noreferrer noopener\">Gambling Commission CEO Andrew Rhodes told attendees of the Betting and Gaming Council’s AGM<\/a> on 27 February. &nbsp;<\/p>\n\n\n\n<p>He noted that prize draw products are experiencing a participation level that is much higher than that of other gambling products, or products regulated as gambling. “It’s getting close to being on a par with betting in terms of participation, also in terms of the average spending,” Rhodes said.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-should-prize-draws-be-regulated-alongside-lottery-nbsp\"><strong>Should prize draws be regulated alongside lottery?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The UK Lotteries Council, a body that represents the sector, has called for a re-evaluation of the currently largely unregulated prize draw vertical. It should fall under traditional lottery regulations, it says. “If there is a shift from society lotteries to unregulated prize draws, returns to good causes will inevitably decline. &nbsp;<\/p>\n\n\n\n<p>Million-pound prize draws represent the thin end of the wedge in lottery-based civil society fundraising,” Lotteries Council chair Tony Vick wrote in a March report on prize draws and charity lotteries. But James Miéville, executive director at Raffle House, a prize draw operator in the UK, says he does not believe the product is in competition with the National Lottery, as it is instead an entirely new demographic of players.  <\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/a8n7k_fnuoypyWYn6zOOpysip0LgX9p0D_GpSPpRfD8\/resizing_type:auto\/width:0\/height:1024\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9KYW1lcy1NaWV2aWxsZS1oZWFkc2hvdC1sb3R0ZXJ5LWZlYXR1cmUuanBn.webp\" alt=\"\" class=\"wp-image-384685\" style=\"width:303px;height:auto\"\/><figcaption class=\"wp-element-caption\">James Miéville of prize draw operator Raffle House says the vertical is not in competition with the UK national lottery<\/figcaption><\/figure><\/div>\n\n\n<p>“We believe companies such as ours have tapped into a previously unmet demand and that this has attracted new players rather than pulling players away from other products,” says Miéville. “Our player data suggests the audience for house prize draws is more diverse than that of lotteries.”  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-free-to-enter\">&#8216;Free to enter&#8217;<\/h2>\n\n\n\n<p>Today, prize draws offer a “free to enter” option, whereby players can send in an entry to a draw, only paying to send the entry. This means the vertical is exempt from falling under lottery rules as per the Lotteries Act. Also writing in the Lotteries Council report, Member of Parliament for Aldridge-Brownhills Wendy Morton warned these new games had become “indistinguishable” from charity lotteries, which are required to meet strict standards, like not offering large prizes or jackpots and paying back a certain percentage of earnings to charity.<\/p>\n\n\n\n<p>The case against prize draws, which are typically offering multimillion-pound prizes to players, is clear: they should be properly regulated, so the traditional lottery sector claims. <\/p>\n\n\n\n<p>In <a href=\"https:\/\/igamingbusiness.com\/legal-compliance\/compliance\/uk-government-voluntary-code-prize-draws-and-competitions\/\" target=\"_blank\" rel=\"noreferrer noopener\">a speech to parliament last week, Gambling Minister Baroness Twycross<\/a> said the vertical would not be placed under the Lottery Act regulations but rather a voluntary code which will seek to unify the vertical’s approach across the sector. <\/p>\n\n\n\n<p>Richard Williams, partner at Keystone Law, told&nbsp;iGB&nbsp;he expects a monitoring period of at least a year for prize draws, to assess whether any measures are successful. He said the code was largely an attempt to avoid introducing legislation.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-healthy-competition-nbsp\"><strong>Healthy competition<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Others in the lottery sector support the innovation behind the new vertical; after all, it is clearly appealing to a new demographic that more traditional lotteries have ignored for decades. Could this feud be exactly what lotteries need to reinvigorate the industry?&nbsp;<\/p>\n\n\n\n<p>“I get the impression that some players in the industry are trying to fight the competition through politics here, and I would say that’s not wise,” Helmut Becker, longstanding CEO for German lottery provider Zeal Network, tells iGB. <\/p>\n\n\n\n<p>“They should focus on innovation in their own business. I do think generally speaking there’s an opportunity for more innovation in our industry.” Becker laments the slow uptake of online lottery offerings. “The internet penetration in the lottery industry is relatively low, particularly in Germany where we are at 25%,” he says. &nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"2560\" src=\"https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-scaled.jpg\" alt=\"Zeal CEO Helmut Becker\" class=\"wp-image-378925\" style=\"width:387px;height:auto\" srcset=\"https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-scaled.jpg 2560w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-300x300.jpg 300w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1024x1024.jpg 1024w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-150x150.jpg 150w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-768x768.jpg 768w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1536x1536.jpg 1536w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-2048x2048.jpg 2048w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-650x650.jpg 650w, https:\/\/igamingbusiness.com\/wp-content\/uploads\/2025\/06\/Helmut-Becker_Franz-Schepers-Photography-for-ZEAL_8-1-1300x1300.jpg 1300w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" \/><figcaption class=\"wp-element-caption\">Zeal CEO Helmut Becker urges lotteries not to stifle innovation from new verticals<\/figcaption><\/figure><\/div>\n\n\n<p>He goes on to compare the sector to other entertainment offerings like concerts, or even transportation services that offer tickets online for trains and buses. “Those industries have much higher rates of digital penetration. I see tremendous growth potential in the lottery industry converting from offline to online. There’s this continuous optimisation in ecommerce best practice [that we could&nbsp;learn from].” &nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-we-ve-seen-this-response-nbsp-before-nbsp\"><strong>We’ve seen this response&nbsp;before<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Zeal rode the wave of lottery betting (or&nbsp;lottery brokerage) solutions as the novel opportunity arose in 1999. <\/p>\n\n\n\n<p>Operators like Zeal and Lottoland offered players a chance to participate in mammoth jackpots, by betting on lottery draws around the world instead&nbsp;of just their national or state-run&nbsp;offering. In the beginning of this wave, operators were heavily scrutinised and many called for new regulations to clamp down on the spread of these types of offerings, similar to the fight against prize draws today. &nbsp;<\/p>\n\n\n\n<p>But Becker argues there is a need among younger and female demographics for new and novel solutions within lotteries. “There are new target groups, other target groups than the traditional lottery player, younger target groups, female target groups. And there are ways to address the needs of those target groups and that’s through product innovation. Creating new types of lotteries or new types of games like Dream House raffle, for example, unlocks another layer of growth [for operators],” he says. <\/p>\n\n\n\n<p>Zeal has both invested in and developed an in-house version of a prize draw offering but offered under a charity lottery licence, and Becker suggests it is this agility and commitment to innovation that has powered Zeal’s progressive growth in recent years.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/igamingbusiness.com\/finance\/full-year-results\/net-profit-record-2024-zeal\/\" target=\"_blank\" rel=\"noreferrer noopener\">In its full-year 2024 results, Zeal posted a record group revenue<\/a> of €188.2 million ($203 million), beating the previous year by 62.2%. It also saw bottom-line net profit rise 333.2% to €59.4 million. On this trajectory, Becker says the company has continuously optimised and grown its core business while making constant improvements in ecommerce, ensuring excellence in unit economics, efficiently allocating marketing spend and ultimately improving the customer lifetime value of its loyal customer base. There is clearly still demand for more traditional lottery betting offerings.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-can-it-cross-sell-nbsp\"><strong>Can it cross-sell?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>In the US, lottery courier services have exploded in the market. These offerings enable players to participate in draws operating in multiple states by buying tickets for different draws and enabling&nbsp;players to purchase them via the product. In February, <a href=\"https:\/\/igamingbusiness.com\/strategy\/draftkings-2025-guidance-lottery-inplay-betting\/\" target=\"_blank\" rel=\"noreferrer noopener\">DraftKings CEO Jason Robins talked up its 2024 acquisition of lottery betting app Jackpocket<\/a>, insisting the product was already proving a valuable customer acquisition and cross-sell tool.&nbsp;<\/p>\n\n\n\n<p>&nbsp;“Jackpocket has been great in terms of both cross-sell and, also, we have had really strong customer acquisition during its last $1 billion jackpot run. I do think that there’s room to invest more there,” Robins told analysts in its Q1 earnings call. &nbsp;<\/p>\n\n\n\n<p>“For us, it’s probably more effective in states where there’s legal sports betting and iGaming because the LTVs (lifetime value) in the immediate term are going to be higher because we can cross-sell right away.”&nbsp;<\/p>\n\n\n\n<p>He compared the product to DFS in terms of player acquisition opportunity, and of course it was DFS that helped skyrocket the likes of DraftKings and FanDuel to the top positions for both betting and iGaming in the States. But Becker says he is less certain of lottery’s cross-sell capabilities. &nbsp;<\/p>\n\n\n\n<p>“The jury is out on how big the synergies between different forms of gambling are, and whether it is possible to capture them and how,” he comments. “I haven’t seen the data yet, so for me the case is not closed on the cross-sell opportunity between lottery players and other forms of gambling being as big as expected.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-lottery-and-igaming\">Lottery and iGaming<\/h2>\n\n\n\n<p>Nikolina Gabelica, head of lottery operations at EveryMatrix, supports Robins’ assertion that lottery games can be successful acquisition tools. “I worked for an operator previously, and it had a clear path to use lottery as an acquisition tool. It’s easier to acquire a player, but not to say it’s cheaper, with lottery games. And that’s including instant games and scratchcards. Yes, this is easier, less frequent and less aggressive play. But it was used for acquisition of the players,” she says. <\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/Lk_uhJJVUXo6u4m650ss14PN7eUfcHe2h9uFymRLFxk\/resizing_type:auto\/width:1024\/height:0\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNy9OaWtvbGluYS1HYWJlbGljYV9FdmVyeU1hdHJpeC5wbmc.webp\" alt=\"\" class=\"wp-image-384682\" style=\"width:506px;height:auto\"\/><figcaption class=\"wp-element-caption\">EveryMatrix&#8217;s Nikolina Gabelica believes lottery can be a good product to cross-sell to iGaming<\/figcaption><\/figure><\/div>\n\n\n<p>“Of course, not all lottery players would transition to sports betting or iGaming. But yes, that journey was a natural one [for players].” However she acknowledges that gamified lottery products offering unique bonuses or a novel element prompt longer gaming sessions and a higher chance for cross-sell capabilities.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-lottery-across-the-pond-nbsp\"><strong>Lottery across the pond<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The US is operating a dynamic and nuanced lottery sector, but like other verticals it is fragmented and many states still have a state-run lottery monopoly in place. Therefore, regulations are hugely outdated and largely do not support new multistate courier operations like Jackpocket. The vertical came under fire in February when a group of investors won two multimillion-dollar jackpots in Texas, after mass purchasing of tickets in bulk, which effectively hacked the system. <\/p>\n\n\n\n<p>The scandal resulted in harsh criticism around the lottery courier offering, and Texas moved to ban these services in the state. <a href=\"https:\/\/oppaga.fl.gov\/Products\/ReportList\" target=\"_blank\" rel=\"noreferrer noopener\">According to 2024 data from the Office of Program Policy Analysis and Government Accountability<\/a>, lottery betting was available in 19 US states last year.&nbsp;<\/p>\n\n\n\n<p>“I think the US lotteries are concerned about it because they are finding themselves competing directly with very mighty private companies that are active in sports betting and iGaming,” Becker explains. “But I honestly don’t know how the US market will play out. I think it will be two steps forward, one step back. I think it will be very heterogeneous and be different in each state. &nbsp;<\/p>\n\n\n\n<p>“Oftentimes there’s no clear regulation for online sales. The courier model evolved because there is demand and somebody is just filling the gap. I think the problem is that there’s no good regulation in place to foster the well-regulated sales of online lottery tickets to customers.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-robust-regulation-is-crucial\">Robust regulation is crucial <\/h2>\n\n\n\n<p>Becker believes that, in order to maintain a thriving and innovative lottery sector, robust regulation is needed. And this is something that appears to be missing in the US. Germany, however, has robust lottery laws in place, he says. And having these laws in place has supported and encouraged the rise of new products and fresh innovations. &nbsp;<\/p>\n\n\n\n<p>He says the gambling regulator in Germany, the GGL, has determined clear boundaries for the lottery sector and this makes it easy for lottery brokerage operators like Zeal to adhere to the rules. “A well-regulated market fosters and incentivises good behaviour and growth. In the end, society benefits from that growth. I do think there’s an opportunity to strike a balance between a well-regulated and open market that is open to private players like us.”&nbsp;<\/p>\n\n\n\n<p>Many European markets also still operate lottery monopolies while others, like the UK and Italy, issue a tender for their national lottery. This is either won by a single lottery provider or a consortium of providers.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-all-change-for-lottery-in-the-uk-nbsp\"><strong>All change for lottery in the UK<\/strong>&nbsp;<\/h2>\n\n\n\n<p>In February 2024, global lottery provider Allwyn won the UK’s National Lottery tender, after almost 20 years of Camelot operating the programme. In securing the fourth licence, Allwyn saw off competition from a number of heavy hitters, including Camelot. However, the operator, which counts a number of European lottery companies under its belt, has faced criticism for failing to deliver on promises made during its successful bid for the lottery. &nbsp;<\/p>\n\n\n\n<p>Areas of concern to the Gambling Commission are said to include delays to digital upgrades. Allwyn is also said to have pledged to reduce ticket prices for the main National Lottery draw from £2 to £1, but this is yet to take place. In a statement issued to iGB, Allwyn said it is still committed to upgrading and modernising the system, with a planned spend of more than £350 million ($467 million) on improvements.  <\/p>\n\n\n\n<p>“Our investment will help restore the magic to The National Lottery,” Allwyn said. “But the shift from outdated systems is complex and requires robust testing. We will deliver essential upgrades over the coming year. We are working at pace to complete this transformation as soon as possible.”&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-can-lottery-keep-up-with-prize-draw-innovation\"><strong>Can lottery keep up with prize draw innovation?<\/strong><\/h2>\n\n\n\n<p>Allwyn shows it is harder to innovate in a legacy sector than some might believe. The outlook for lottery is positive. Becker believes there is much more to be achieved in the space, particularly in increasing the rate of digitisation. The demand for new lottery-style games will continue to grow as Gens Z and Alpha turn the appropriate age for playing these games. But national lotteries are certainly at risk of falling behind.&nbsp;<\/p>\n\n\n\n<p>“They’re setting a new standard for how play should feel,” Gabelica says of the “quick, easy experiences” of sweepstakes, crypto games and prize draws. “This is very difficult for lotteries to catch up [to]. And the risk is that if [these new games] change what players expect, and if the national lotteries don’t keep up, they will feel outdated, even if the prizes are much bigger,” she concludes.<\/p>\n"
  },
  {
    "title":"Norsk Tipping set for crunch talks with regulator following Eurojackpot scandal",
    "date":"2025-07-01T09:41:26",
    "link":"https:\/\/igamingbusiness.com\/legal-compliance\/legal\/norsk-tipping-crunch-talks-regulator-eurojackpot-scandal\/",
    "content":"\n<p>Norsk Tipping faces urgent talks with Norway’s gambling regulator, as Lottstift investigates whether the operator’s Eurojackpot payout error breached national gambling laws.<\/p>\n\n\n\n<p>The state-owned gambling monopoly has come under intense scrutiny after nearly 16,000 players received <a href=\"https:\/\/igamingbusiness.com\/lottery\/online-lottery\/norsk-tipping-ceo-quits-after-eurojackpot-debacle\/\" target=\"_blank\" rel=\"noreferrer noopener\">incorrect messages about their Eurojackpot winnings<\/a>. A major technical error in the currency conversion system caused messages to show inflated payouts — some by as much as 10,000 times the actual prize.<\/p>\n\n\n\n<p>The fallout led to the resignation of Tonje Sagstuen, Norsk Tipping’s CEO. However, the controversy continues to escalate.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-medium\"><img decoding=\"async\" src=\"https:\/\/igamingbusiness.com\/img-srv\/JNv87A7KNsu7tsn-IIXgIqImPPzoX_oo-dlpBaceTBw\/resizing_type:auto\/width:300\/height:0\/gravity:sm\/enlarge:1\/ext:webp\/strip_metadata:1\/quality:90\/bG9jYWw6Ly8vaWdhbWluZ2J1c2luZXNzLmNvbS93cC1jb250ZW50L3VwbG9hZHMvMjAyNS8wNi9ub3Jzay10aXBwaW5nLmpwZw.webp\" alt=\"\" class=\"wp-image-384394\"\/><figcaption class=\"wp-element-caption\">Norsk Tipping&#8217;s former CEO Tonje Sagstuen<\/figcaption><\/figure><\/div>\n\n\n<p>Lottstift confirmed it has received a preliminary incident report from Norsk Tipping detailing the events following Friday’s Eurojackpot draw. The regulator will decide on next steps after its scheduled meeting with the operator on Tuesday.<\/p>\n\n\n\n<p>“This is a serious matter, which is clearly harmful to Norsk Tipping,” said Terje Gilleshammer, communications director at Lottstift. “Our job is to assess whether what has happened is a violation of the Gambling Act.<\/p>\n\n\n\n<p>“We are in the process of thoroughly reviewing [the report], and will have a meeting with Norsk Tipping [on Tuesday]. We will of course inform you when we have considered this matter. This is an error that is of great public interest, and which has affected many players.”<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-anger-over-ceo-s-big-money-payoff\">Anger over CEO’s big money payoff<\/h2>\n\n\n\n<p>The Eurojackpot glitch caused widespread public distress. Many Norwegians believed they had won life-changing prizes and made financial commitments — such as booking holidays or placing deposits on new homes — before discovering the truth. Sagstuen acknowledged these consequences in her resignation letter.<\/p>\n\n\n\n<p>Adding fuel to the fire, Sagstuen reportedly received a severance package of NOK3 million (€252,000), awarded by Norsk Tipping’s board, chaired by Sylvia Brustad. The payout has sparked outrage among opposition politicians, including the Centre Party, Red Party, and Progress Party.<\/p>\n\n\n\n<p>Silje Hjemdal of the Progress Party — which <a href=\"https:\/\/igamingbusiness.com\/legal-compliance\/regulation\/norway-progress-party-mp-gambling-monopoly\/\" target=\"_blank\" rel=\"noreferrer noopener\">opposes the monopoly itself<\/a> — condemned both the severance and the company’s leadership.<\/p>\n\n\n\n<p>“NOK3 million in severance pay to the CEO after yet another scandal under her leadership is beyond all reason,” said Hjemdal.<\/p>\n\n\n\n<p>“I expect that minister of culture Lubna Jaffery will also consider whether she has confidence in the chairwoman of the board Sylvia Brustad. I have serious questions about Brustad&#8217;s handling of the departure of the CEO, and she is also partly responsible for all the scandals that have hit the company in recent years.”<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-norsk-tipping-controversies\">Norsk Tipping controversies<\/h2>\n\n\n\n<p>The criticism is compounded by past controversies at Norsk Tipping, including incidents involving underage gambling and failures in self-exclusion systems.<\/p>\n\n\n\n<p>The Norwegian Industry Association for Online Gaming (NBO) argues that the justification for Norsk Tipping’s monopoly has collapsed. In a recent op-ed for <a href=\"https:\/\/www.ostlendingen.no\/hjemme-alene-festen-ma-ta-slutt\/o\/80-69-43641\" target=\"_blank\" rel=\"noreferrer noopener\">Ostlendingen<\/a>, NBO Secretary General Carl Fredrik Stenstrøm challenged the company’s ability to operate safely and with public trust.<\/p>\n\n\n\n<p>“Norsk Tipping&#8217;s exclusive right to offer gambling in Norway rests on two conditions, both of which are enshrined in the Gambling Act… that the monopoly arrangement is by far the safest option for curbing gambling problems… that Norsk Tipping shall conduct gambling in an honest manner that is suitable to win the trust of the general public.<\/p>\n\n\n\n<p>“Over the past six months, both of these conditions have been violated. Not in a trivial and grey-zone-like way, but with a bang. And time after time.”<\/p>\n"
  },
  {
    "title":"CDC Gaming Roundtable: In five years, the gaming industry landscape will be different",
    "date":"2025-07-01T19:00:35",
    "link":"https:\/\/cdcgaming.com\/cdc-gaming-roundtable-in-five-years-the-gaming-industry-landscape-will-be-different\/",
    "content":"<p>In 2020, the gaming industry landscape looked remarkably different.<\/p>\n<p>Legal sports betting was only two years old and operators spent enormous sums of money vying for customers. Cashless payments were a trendy new development that seemed on the verge of widespread adoption. And almost no one had heard of sweepstakes or prediction markets.<\/p>\n<p>Flash forward to 2025: The number of sports betting operators has been winnowed, with clear winners, including DraftKings and FanDuel, now the market leaders. The adoption of cashless payment systems has progressed steadily but is still not widespread. And sweepstakes and prediction markets are currently hot-button issues in the industry that were largely unknown in 2020.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2586799142\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3595142280\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/105836\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"719\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"mindwaybanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Mindway-web-250708.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('mindwaybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Mindway-web-250708.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 719;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div><\/div>\n<p>In five years, the gaming industry will likely reflect similar change, some not yet apparent.<\/p>\n<p>CDC Gaming recently hosted a roundtable on what the gaming industry will look like in 2030. Three industry insiders took part: Dr. Laila Mintas, an entrepreneur and strategic advisor; Daniel Wallach, U.S. gaming law and sports betting attorney; and Anne Hay, PayNearMe Executive Vice President and CMO.<\/p>\n<p>Mintas said it’s instructive to look back at where the gaming industry stood in 2020 before looking ahead. She recalled that operators were in the midst of a “gold rush” regarding the then two-year-old repeal of the Professional and Amateur Sports Protection Act (PASPA), and that “no one really cared about user acquisition costs. People were spending like there’s no tomorrow.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2357360819\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/74715\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"Vector Solutions web 250714\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/07\/Vector-Solutions-web-250714.jpg\" alt=\"\"  srcset=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/07\/Vector-Solutions-web-250714.jpg 720w, https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/07\/Vector-Solutions-web-250714-375x93.jpg 375w\" sizes=\"(max-width: 720px) 100vw, 720px\" class=\"no-lazyload\" width=\"720\" height=\"178\"   \/><\/a><\/div>\n<p>In five years, Mintas says, expect chaos to continue.<\/p>\n<p>“As of today, we have seven states in the U.S. that have online casino and I think this regulatory environment left a big gap in the market,” Mintas said. “That enabled the operators that you see that are now coming in and disrupting, if you can speak even from disruption, because the market is still so young. But you see crypto.com coming in. You see all the sweepstakes coming in. You see the prediction markets, like the Kalshi’s of the world.<\/p>\n<p>“There&#8217;s so much going on right now in the market. I think in five years from now, or in the next five years, we will see a lot of legal cases and fights and about who gets what share of that big pie. And it will probably get pretty, pretty heated. And I think there will be new operators and new businesses coming in, trying to ban existing regulations, using loopholes, trying to regulate in a different way.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3766280493\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/72800\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"trustlybanner\"  role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Trustly-web-250701.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('trustlybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/07\/Trustly-web-250701.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>Wallach said the repeal of PASPA paved the way for unanticipated actions that are now reverberating. He said that Native American tribes are now using the Indian Gaming Regulatory Act to advance online gaming; that daily fantasy contests have expanded to include player proposition bets; that sweepstakes have emerged, and the Commodity Futures Trading Commission (CFTC) is now the regulator for the sports prediction market.<\/p>\n<p>The repeal of PASPA not only created a regulated marketplace but also incentivized some individuals and companies to look for shortcuts.<\/p>\n<p>“We’re now redefining what a bet is, what a wager is, what is an entry fee, what&#8217;s a contest, what&#8217;s a game of skill, what&#8217;s a game of chance, what&#8217;s a commodity,” Wallach said. “It&#8217;s all part of a common thread of the significant financial upside associated with gaming, creating ingenuity.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-92004145\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/97541\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"conjointlybanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Conjointly-web-250318.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('conjointlybanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Conjointly-web-250318.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script>\r\n\r\n<\/a><\/div>\n<p>“They call it innovation, but in many ways, it&#8217;s a workaround or a loophole that&#8217;s being exploited based on either actual or perceived gaps in the law. And I don&#8217;t know that this represents a safe opportunity for investment. I think there&#8217;s a lot of volatility in play here because each of these expanded areas, saved for tribal digital gaming, has attracted significant scrutiny from states and from courts, and it is a very uncertain investment climate. The one thing I do know is that there will always be something else. There will be something else to come in that we didn&#8217;t see today.”<\/p>\n<p>Hay says the payments space is rife with legacy platforms that were “falling short” and that inefficiencies are abundant. PayNearMe has worked to rectify those shortcomings and foresees new payment types emerging in the near future.<\/p>\n<p>She notes that PayNearMe consistently receives inquiries about using cryptocurrencies as a form of payment. Hay said that the recent FiServ announcement that it is launching a stablecoin for banks opens up a new avenue that players may embrace, especially since there are a lot of fraud and risk controls associated with the development.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-3327225536\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/40783\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"99\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"passportbanner\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/06\/Passport-web-240611.mp4\" type=\"video\/mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('passportbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/06\/Passport-web-240611.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 99;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script><\/a><\/div>\n<p>“This payment has a potential to be faster and cheaper,” Hay said. “And it’s not even five years out &#8212; I think that&#8217;s going to be even sooner. And things like stablecoin also seem to have a tighter set of controls, because the banks are behind it. And so, I expect that will be favorable for regulators and things like that.”<\/p>\n<p>The increased use of artificial intelligence in gaming also seems to be inevitable, although Mintas admits, “our industry is not the most innovative industry.”<\/p>\n<p>‘But I think we will be like a target zone, because most of the gambling industry, at least that I&#8217;m dealing with, is online,” Mintas says. &#8220;So, it&#8217;s perfect. It&#8217;s perfect to be targeted for AI products.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2016581579\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14492\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"90\" fullscreen=\"false\" playsinline playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"player\"  role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2024\/02\/CDC-Consulting-web-banner-240202.mp4\"type=\"video\/mp4\">\r\n<\/video><\/a><\/div>\n<p>Hay considers AI to be the prototypical buzzword. Every company in the gaming industry is either using AI or discussing how to use artificial intelligence, but no one has figured out how best to deploy it.<\/p>\n<p>She notes that PayNearMe is currently experimenting extensively with AI. Hay suggests that in the near future, companies should “lean into it” and hire experts instead of trying to grapple with AI on their own. There are indications, at least in the payments space, that AI will be beneficial.<\/p>\n<p>“We&#8217;re seeing some promising signs where it&#8217;s helping operate or sort of increase those acceptance rates,” Hay said, “and ultimately just provide a better experience for players and removing some of those barriers to completing deposits or withdrawals.”<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2690608372\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/45076\" rel=\"noopener\" class=\"notrack\" target=\"_blank\"><video width=\"720\" height=\"180\" fullscreen=\"false\" playsinline autoplay muted loop poster=\"\" controlsList=\"nodownload\" id=\"koinbanner\" role=\"presentation\" aria-hidden=\"true\">\r\n<source src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Koin-web-250228.mp4\">\r\n<\/video>\r\n<script>\r\n    document.addEventListener(\"DOMContentLoaded\", function() {\r\n        var isFirefox = typeof InstallTrigger !== 'undefined';\r\n        var videoPlayer = document.getElementById('koinbanner');  \/\/ replace with unique advertiser id\r\n        \r\n        if (isFirefox) {\r\n            var gifFallback = document.createElement('img');\r\n            gifFallback.src = 'https:\/\/cdcgaming.com\/wp-content\/uploads\/2025\/03\/Koin-web-250228.webp'; \/\/ Your fallback URL here\r\n            gifFallback.width = 720;\r\n            gifFallback.height = 180;\r\n            videoPlayer.parentNode.replaceChild(gifFallback, videoPlayer);\r\n        }\r\n    });\r\n<\/script>\r\n\r\n<\/a><\/div>\n<p>Sweepstakes and prediction markets, however, loom large on the horizon. While many states, including Michigan, Louisiana, New York, Mississippi, and California, have issued cease-and-desist orders to companies hosting sweepstakes games and prediction markets, Kalshi, notably, has resisted any impediments to doing business.<\/p>\n<p>Kalshi, regulated by the CFTC, currently can operate in all 50 states, claiming it doesn’t offer gambling.<\/p>\n<p>According to Wallach, Kalshi and other prediction market companies insist that because they are regulated by the CFTC, they are able to operate.<\/p><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2793196825\"><div class=\"cdcgaboba-content-placement-after-3rd-paragraph\" style=\"text-align: center;margin-bottom: 1em;\" id=\"cdcgaboba-2789328832\"><a data-bid=\"1\" data-no-instant=\"1\" href=\"https:\/\/cdcgaming.com\/out\/14507\" rel=\"noopener\" class=\"notrack\" target=\"_blank\" aria-label=\"smokefree-protect-workers-720&#215;90-1.gif\"><img loading=\"eager\" decoding=\"async\" src=\"https:\/\/cdcgaming.com\/wp-content\/uploads\/2022\/09\/smokefree-protect-workers-720x90-1.gif\" alt=\"\"  class=\"no-lazyload\" width=\"720\" height=\"90\"   \/><\/a><\/div><\/div>\n<p>“I think under a traditional preemption analysis, I think the states do have the better argument,” Wallach says. “But I think the ultimate trump card here, no pun intended, belongs to the Trump administration, because even if the states win, which is maybe potentially in a year to two years of a dog fight in the federal courts, as long as Trump retains control over our Congress, the administration&#8217;s response to a loss in court could simply be to usher in statutory amendments to the Commodity Exchange Act, to make clear or to clarify that sweepstakes and commodities can include event contracts tied to real world.”<\/p>\n"
  }
]